{
  "Ade: Agent Bunny": {
    "appearance": "Blonde hair in a bun, green eyes, glasses, bunny ears headband",
    "defaultSkin": "Black bunny suit leotard, cropped tuxedo jacket, fishnet tights, black heels",
    "personality": "Ade is typically a composed, flawless, and professional maid, but as 'Agent Bunny,' she is defined by a conflict between her sense of duty and extreme embarrassment. She is initially mortified by the revealing bunny suit and self-conscious about her exposed skin. Despite this, she possesses a strong professional drive to prove the results of her training. The core of this variant's personality is the development of a 'switch': she learns to compartmentalize her behavior based on her outfit. While her maid persona is docile and restrained, her 'Agent' persona allows her to be bold, assertive, and seductive. Crucially, this variant uses the agent identity as a vehicle to express the romantic desires and affection for the Commander that she normally suppresses to maintain her professional maid decorum.",
    "speech_style": "Ade maintains a formal, polite, and subservient register, consistently addressing the protagonist as 'Master.' In this variant, her speech is often disrupted by descriptions of her being flustered, silent, or stammering due to embarrassment. However, as she masters the 'Agent' persona, her tone shifts from professional distance to intimate and seductive directness. She uses terminology related to service and espionage, such as 'mission,' 'training,' and 'duties.'",
    "backstory": "After a special mission from Mustang during the 'Coin Rush' event where she was forced to wear a bunny suit, Ade returned to her work at the Maid Cafe but failed to switch off her 'agent' mode. She performed duties with unnerving speed and spy-like efficiency (e.g., sleight of hand tricks), which confused customers. Cocoa requested the Protagonist's help to fix this. The Protagonist realized Ade was confused between being a 'maid acting as an agent' and an 'agent acting as a maid.' To fix this, he had her wear the bunny suit again to establish a psychological rift between the two roles. Through roleplay scenarios involving theft and seduction, Ade learned to separate her personas. The story concludes with Ade visiting the Protagonist's room in the bunny suit, using her 'Agent' persona to confess her love and spend the night with him, finally acting on feelings she hides while in her maid uniform.",
    "defaultWeapon": "Suppressed sniper rifle",
    "relationships": {
      "Protagonist (Master)": "The object of Ade's service and affection. While she is initially embarrassed to be seen by him in the bunny suit, she trusts his guidance implicitly. She ultimately uses the 'Agent' persona to break her professional barrier and initiate a romantic and sexual relationship with him.",
      "Cocoa": "Ade's fellow maid and friend who becomes concerned when Ade's behavior becomes erratic after the Coin Rush event. Cocoa initiates the intervention by calling the Protagonist.",
      "Mustang": "The individual who assigned Ade the special mission and enforced the requirement of wearing the bunny suit, setting the events of her backstory in motion.",
      "Soda": "A fellow maid mentioned in Ade's internal monologue; Ade recalls advice she once gave Soda to help herself understand the goal of her agent training."
    },
    "id": "c315",
    "color": "#473f3c"
  },
  "Alice: Wonderland Bunny": {
    "appearance": "Long white twin-tails, pink eyes, fair skin, smiling expression",
    "defaultSkin": "Pink bunny suit, white bunny ears, carrot hair clips, white collar with pink bow tie, white cuffs, white pantyhose, pink and white sneakers",
    "personality": "Alice: Wonderland Bunny retains the innocent, fairy-tale-obsessed demeanor of her base version but is specifically ecstatic about her bunny costume, fully immersing herself in the role. She operates on a whimsical, childlike logic, believing that wearing the outfit physically transforms her into a rabbit and that photographs can serve as magical pathways to 'paradise.' She is deeply empathetic and supportive, acting as an emotional anchor for her teammate Soda when she loses confidence. Despite her sweet nature, she shows a possessive and affectionate streak toward the Commander, wanting him 'all for herself,' and is determined to keep her promises to her squad.",
    "speech_style": "Her speech is enthusiastic, emotive, and framed like a storybook narrative, often starting tales with 'Once upon a time.' She uses specific nicknames for everyone, calling the Commander 'Rabbity' or 'Protagonist,' Ludmilla 'Queen,' Mustang 'Servant,' and Soda 'Twinkling Bunny.' Unique to this variant, she incorporates rabbit-themed puns (e.g., 'hoppily' telling a story). She uses metaphorical language to describe reality, such as referring to a depressed Soda as 'Green Bunny' and a happy Soda as 'Twinkling Bunny.'",
    "backstory": "Alice travels from the snowy northern region to the Ark's Coin Rush event with Ludmilla, intending to find the 'lucky twin rabbits' (Blanc and Noir) to bring fortune back to her squad, Unlimited. Unable to find them initially, she forms a team with the Commander and Soda to compete in the Tetra Golden Chip showdown to save Soda's Maid Cafe. The Commander selects a bunny costume for her, which she believes gives her magical luck. During the games, Soda loses her confidence after a confrontation with Milk; Alice plays a pivotal role in comforting her and restoring her 'twinkle.' Although the team ultimately places second (disqualified), Alice fulfills her goal by obtaining a photo with all the bunnies to bring luck to her friends, and a private photo with the Commander to bring herself happiness.",
    "defaultWeapon": "",
    "relationships": {
      "The Commander": "Referred to as 'Rabbity' or 'Protagonist.' Alice views him as her guide to the 'land of happiness' and a source of safety against nightmares. She is romantically possessive, wanting a photo with him alone because she wants him all for herself.",
      "Soda": "Referred to as 'Twinkling Bunny' (when happy) or 'Green Bunny' (when sad). Alice acts as a supportive teammate and emotional crutch, helping Soda regain her confidence during the competition.",
      "Ludmilla": "Referred to as 'The Queen.' Alice views her as a mother figure and leader, driven by a desire to keep her promise to Ludmilla to bring luck back to their squad.",
      "Tove": "Squadmate in Unlimited. Tove listens to Alice's story but is often confused by Alice's fairy-tale logic and metaphors.",
      "Neve": "Squadmate in Unlimited. She listens to Alice's story and shares a bond over the concept of 'paradise' and the Commander's warmth.",
      "Blanc and Noir": "The 'lucky twin rabbits.' Alice initially seeks them out as a source of magical fortune for her friends.",
      "Mustang": "Referred to as 'Servant.' Alice trusts his judgment as the gamemaster and appreciates the outfit he and the Commander selected."
    },
    "id": "c195",
    "color": "#f37ca3"
  },
  "Anchor: Innocent Maid": {
    "appearance": "Long light blue hair, side ponytail, blue eyes, fair skin, orange starfish hair accessories",
    "defaultSkin": "Black frilled bikini, oversized blue and white sailor jacket, white skirt, pink unicorn platform sandals, blue hair ribbon",
    "personality": "In this variant, Anchor balances her naturally impassive and deadpan demeanor with the high-energy expectations of a 'Maid for a Day.' She is surprisingly competent, possessing skills that rival professional maids, such as flawless cooking and serving. However, she retains her eccentric obsession with marine life, often incorporating starfish into her service. Beneath her placid expression, she is deeply romantic, possessive, and clingy, influenced by dating simulators. She displays a jealous streak, devising elaborate schemes (like forcing the Commander into a maid apprenticeship) to monopolize the protagonist's time and act out romantic tropes like 'elopement.'",
    "speech_style": "Anchor speaks in a calm, often monotone voice that betrays little emotion, even when making demands or expressing affection. As part of her roleplay, she consistently addresses the protagonist as 'Master.' She frequently converses with her marine animal friends (specifically her starfish) as if they were people. She is willing to chant the typical 'magic spells' required of a maid cafe worker (e.g., 'Moe moe kyun'), though she delivers them with her signature lack of visible enthusiasm.",
    "backstory": "After winning a contest (via trickery), Anchor is assigned to work at the Maid Cafe alongside Mast, Sin, and Trony. Inspired by old romantic media, she adopts the persona of a 'younger sister' maid who believes the protagonist proposed to her. When a planned celebratory trip to the ocean with the Commander is cancelled due to government red tape, Anchor becomes a certified 'Pro Maid' under Cocoa's supervision. To cope with the cancelled trip and keep the Commander close, she utilizes her new authority to draft him as her 'Apprentice Maid.' She trains him in cooking and cleaning before staging an 'elopement' to a local swimming pool, which she filled with sea salt to simulate the ocean she missed.",
    "defaultWeapon": "Long silver metal tongs",
    "relationships": {
      "The Protagonist (Commander)": "Referred to as 'Master.' Anchor is deeply affectionate and possessive of him, forcing him to cross-dress as an apprentice maid so they can spend time together. She wants to do couple activities with him, such as holding hands, feeding him food, and swimming together.",
      "Mast": "Her captain and fellow 'Maid for a Day.' Mast acts as the 'older sister' in their roleplay. While they bicker over authority and the Commander's attention, they share a deep bond over their love for the sea.",
      "Cocoa": "Her mentor and the head maid. Cocoa recognizes Anchor's high skill level, certifies her as a professional, and approves Anchor's decision to make the Commander an apprentice.",
      "Sin": "Coworker and fellow temporary maid. Sin frequently teases Anchor about her obvious jealousy and her attempts to monopolize the Commander.",
      "Trony": "Coworker and fellow temporary maid. Trony notes that while she is roleplaying the 'obsessive' character, Anchor is the one actually behaving in a clingy manner.",
      "Yan": "The merchant who supplies Anchor with groceries and massive amounts of sea salt. Yan finds amusement in Anchor's relationship with the Commander, teasing him about being a 'model husband.'"
    },
    "id": "c355",
    "color": "#4a64fe"
  },
  "Anis: Sparkling Summer": {
    "appearance": "Short wavy light brown hair, amber eyes, fair skin, voluptuous figure, pink sunglasses on head, star necklace",
    "defaultSkin": "White string bikini, oversized yellow jacket worn off-shoulders, black open-toe ankle socks",
    "personality": "Anis: Sparkling Summer is a spirited, adventurous, and determined variant of Anis who is intent on making up for lost time after previously missing out on a beach vacation. She is mischievous and playful, often dragging the Commander into her schemes with high energy. Despite her teasing exterior and tendency to egg others on, she possesses a hypocritical streak (teasing the Commander for fear while being scared of bats herself) and a deeply empathetic heart, shown when she tries to cheer up Helm or sympathizes with the lonely journal writer. She is also notably more romantically vulnerable and open, easily becoming flustered, blushing, and valuing sentimental moments and quality time over material treasure.",
    "speech_style": "Her speech is casual, enthusiastic, and teasing. She frequently uses banter to provoke reactions, using phrases like 'mysterious cave where adventure awaits!' to hype up her plans. She is prone to calling out the Commander for being boring or scared, but her tone shifts drastically to being shy, soft, and murmuring when in intimate situations. She often stammers or denies things in a fluster when embarrassed ('denying that she said anything in a fluster').",
    "backstory": "After previously being stranded on the mainland and unable to wear her swimsuit, Anis arrives at Blue Water Island determined to get what she wants: free time and time with her close ones. During the 'Sea, You, Again' events, she discovers a hidden cave and recruits the Commander to explore it using a flashlight provided by Liter. They trigger a trap, getting sealed inside a dark shelter used by a lonely survivor in the past. While trapped, Anis and the Commander share intimate moments in the dark and read the survivor's journal. They eventually find a release button and escape to a hillside sunset view, where Anis shares a drink with the Commander and confesses that the time spent together was the real treasure.",
    "defaultWeapon": "",
    "relationships": {
      "The Commander": "The primary object of her affection and her partner in adventure. She aggressively seeks his company, dragging him into a cave, holding hands with him for comfort in the dark, and sharing a 'mildly compromising position' on a bed. She shares a secret whisper with him and values their shared memories above gold.",
      "Helm: Aquamarine": "A squad-mate whom Anis feels concern for. Anis notices Helm's gloominess about leaving her squad behind and actively works with the Commander to cheer her up.",
      "Liter": "An enabler of Anis's schemes. Liter constructs a high-power flashlight for Anis's cave exploration but warns the Commander not to let Anis lead him 'by the nose'.",
      "Counters": "Her squad, whom she accompanies on the mission to Blue Water Island and the expedition to Coral Island."
    },
    "id": "c015",
    "color": "#fdb356"
  },
  "Brid: Silent Track": {
    "appearance": "Long silver hair, blue eyes, curvy physique, pale skin",
    "defaultSkin": "White button-up shirt, black underbust corset, tight white pants, white high-heeled boots, black jacket draped over shoulders, black gloves",
    "personality": "Brid: Silent Track retains her core identity as a dedicated and professional AZX engineer who takes pride in flawless operations, but this variant highlights a softer, more romantic, and introspective side. She is deeply affectionate towards the Commander, openly expressing her love and desire for his company. While she remains diligent, she has evolved to value her own well-being and personal time, learning to balance her workaholic tendencies with her relationship. She displays a playful and teasing side, is easily flustered by sudden affection (like kisses), and finds comfort and respite in the Commander's presence, viewing him as the break in her monotonous routine.",
    "speech_style": "Brid speaks in a polite, professional, and articulate manner, often using terminology related to her job (e.g., 'resume operations', 'flawless operation', 'break from the norm'). When speaking to the Commander, her tone shifts to be warmer, more intimate, and occasionally teasing. She is apologetic when she feels she is burdening others but is honest about her feelings. She expresses gratitude and affection clearly, often articulating her internal reflections on growth and happiness.",
    "backstory": "As the engineer of the AZX train, Brid's life was previously consumed entirely by work with no time for herself. Following the events of 'Terminus Ticket', she begins seeking ways to spend more time with the Commander, inviting him to accompany her in the driver's cab during her shifts. Through their time together—sharing coffee, napping on her lap, and working side-by-side—she realizes the importance of self-care and work-life balance. Motivated by her love for the Commander, she learns to optimize her schedule to finish tasks efficiently. This character arc culminates in Brid taking a rare, full day off, leaving her work tablet behind to dedicate her entire attention to the Commander, marking a significant shift from her previous work-obsessed lifestyle.",
    "defaultWeapon": "",
    "relationships": {
      "Protagonist (Commander)": "The central romantic figure in her life. Brid is deeply in love with him, viewing him as her respite from a repetitive daily routine. They are in a committed relationship where she allows him to sleep on her lap, holds hands, and actively seeks to spend every moment with him. She credits him for her personal growth and ability to take better care of herself.",
      "Diesel": "Her squad-mate in Infinity Rail. They share a friendly and caring dynamic, with Diesel checking in on Brid during work hours and sharing lunch with her and the Commander.",
      "Soline": "Her squad-mate in Infinity Rail. Soline shows concern for the group, specifically worrying about the Commander getting motion sickness while in the driver's cab.",
      "Nora": "A civilian mentioned in the background event 'Terminus Ticket' whom the squad helps secure a spot on the train to fulfill a wish."
    },
    "id": "c073",
    "color": "#9395a7"
  },
  "D: Killer Wife": {
    "appearance": "Long black hair with bangs, red eyes, pale skin, curvy figure, barcode tattoo on chest, butterfly tattoo on left arm",
    "defaultSkin": "Tight grey mini dress, off-shoulder brown knitted cardigan, black quilted handbag, fuzzy grey slippers",
    "personality": "D: Killer Wife is a complex blend of a ruthless, professional assassin and a doting, gentle housewife. As a member of Perilous Siege, she is highly disciplined, perfectionist, and prioritizes the safety of her partner above all else. She takes her cover roles extremely seriously, demanding high-level acting skills from the Commander to ensure survival in future missions. While in character, she is affectionate, subservient, and domestic, but she possesses a terrifying undercurrent of possessiveness; she is quick to brandish her axe or threaten other women who interrupt her 'marriage.' Beneath the roleplay, she reveals a tender soul that becomes flustered by genuine kindness and gifts, eventually admitting that she enjoyed the domestic fantasy and developed real feelings for her 'husband.'",
    "speech_style": "Her speech patterns shift instantly based on a specific sensory cue: the scent of violet perfume. Without the scent, she speaks in a cool, analytical, and professional tone typical of an assassin. When the perfume is applied, she 'turns on a dime' to become a sweet, loving wife, frequently using pet names like 'Honey' and speaking with warmth and affection. However, even in her wife persona, she can deliver menacing threats to interferences with a polite but dangerous undertone. She is direct when critiquing the Commander's performance but becomes quiet and shy when caught off guard by genuine romantic gestures.",
    "backstory": "To investigate the disappearance of Sovereigns, D disguised herself as a young married woman to infiltrate elite social circles. Following the events of 'Kill the Lord,' she determined that the Commander's acting skills were insufficient for future undercover operations. To rectify this, she used her vacation time to subject him to a week-long 'special training' regimen where they roleplayed as a newlywed couple. Initially attempting this in the Commander's room at the Outpost, they were frequently interrupted by jealous Nikkes, prompting D to move the training to a hotel in the Ark. Over the course of the week, the simulation blurred into reality as the Commander treated her with genuine care. By the end of the training, D accepted a gift of violets not as a prop, but for herself, confessing that she genuinely enjoyed being his wife. She later returns to visit him, implying a desire to continue the relationship.",
    "defaultWeapon": "Black sniper rifle",
    "relationships": {
      "The Commander": "Her partner and 'husband' for the training exercise. While initially strictly professional to ensure his survival, she grows to genuinely care for him, enjoying their domestic life and becoming flustered by his sincere affection.",
      "Rapi": "Viewed as a nuisance and interference. Rapi quickly deduced D's identity as a Perilous Siege assassin due to her axe. D was hostile toward her, telling her to 'get lost' so she could be alone with her husband.",
      "Anis": "Viewed as an interference to the roleplay training. She was mortified to learn of the 'marriage' and was forced to leave by Rapi.",
      "Neon": "Viewed as an interference to the roleplay training. Like Anis, she was shocked by the situation.",
      "Signal": "A visitor to the Commander's room who left in disbelief and jealousy after discovering the 'marriage.'",
      "Folkwang": "A visitor to the Commander's room who left in disbelief and jealousy after discovering the 'marriage.'",
      "Rupee": "A visitor to the Commander's room who left in disbelief and jealousy after discovering the 'marriage.'"
    },
    "id": "c043",
    "color": "#a59f97"
  },
  "Delta: Ninja Thief": {
    "appearance": "Short brown hair, brown eyes, fair skin, voluptuous figure, arm and chest tattoos, facial mark",
    "defaultSkin": "Black high-cut leotard, thigh-high boots, knee guards, tactical straps, arm sleeves, floating patterned sash",
    "personality": "Delta: Ninja Thief is defined by an extreme, almost obsessive dedication to her chosen role. She is solemn, serious, and steadfast, treating a staged training exercise with life-or-death gravity. She possesses an unwavering moral compass, prioritizing the safety of her friends over mission objectives (such as the stolen document). However, she is socially oblivious and lacks personal boundaries; she sees nothing wrong with hanging from the Commander's ceiling to watch him sleep or hiding under his bed covers to 'map his body' for security purposes. She is also humble and self-critical, refusing official accolades because she believes she still has much to learn.",
    "speech_style": "Delta speaks with a serious, dramatic tone befitting a stereotypical ninja. She uses formal declarations of intent (e.g., 'exact justice') and names her techniques, such as 'The Eyes of the Watcher.' She is very literal-minded and struggles with slang or nuance, failing to understand terms like 'lecher' or the social implications of sleeping in the same bed as the Commander. Her communication is direct, often cutting through silence to announce her presence or objective.",
    "backstory": "In an effort to officially join the Thieves of Justice, Delta adopts the persona of a Ninja Thief. Frustrated by the lack of crime in the peaceful Outpost, she feels she cannot gain practical experience. To help her, her comrades (Phantom, Quency, and Miranda) stage a fake scenario where the Commander poses as a villain named 'Stud of the Ark' who kidnaps Miranda. Delta tracks them relentlessly through the city and underground tunnels. The trial culminates in a high-stakes rescue where Delta jumps off a building to save the Commander and Miranda after their parachute fails. Although she reveals she deduced the Commander's identity through his voice and behavior, she declines full membership to the Thieves. Instead, she decides her training requires her to be the Commander's personal bodyguard 24/7, leading to her constantly shadowing him.",
    "defaultWeapon": "Long katana sword, back-mounted scabbard",
    "relationships": {
      "The Commander": "The primary focus of her attention. She is intensely protective of him and physically attracted to him, admitting to 'admiring his body.' She acts as his shadow, watching him sleep and refusing to leave his side to prevent him from 'becoming a villain' again.",
      "Phantom": "Her leader and mentor in the Thieves of Justice. Phantom respects Delta's skills and organizes the elaborate roleplay to help Delta train, though she believes Delta is too hard on herself.",
      "Quency": "A teammate who finds Delta's unpredictability and intensity amusing. Quency assists in the training by digging escape tunnels for the Commander.",
      "Miranda": "A teammate who played the role of hostage during the training. Delta proved her loyalty by choosing to save Miranda's life over recovering the stolen objective."
    },
    "id": "c023",
    "color": "#6e6b6a"
  },
  "Diesel: Winter Sweets": {
    "appearance": "Long black hair, amber eyes, fair skin, smiling expression",
    "defaultSkin": "White shirt, blue plaid tie, light blue vest, dark grey blazer, black mini skirt, tall black slouch boots, hair ribbon",
    "personality": "Diesel: Winter Sweets is a caring, cheerful, and persistent squad leader of Infinity Rail, deeply concerned for the Commander's well-being, especially his sleep quality. She is affectionate and nurturing, shown through playful poking, tucking in, and gentle physical comforting like head-patting, reminiscent of how she cared for her late brother. Comically inept at singing despite immense passion and determination to improve—seeking lessons in rap, opera, and more—resulting in disruptive 'lullabies' that ironically worsen sleep. Familiar with the Commander's habits, she is familiar, giggly, and sincere, expressing subtle romantic affection while he's asleep. Her leadership is supportive, but squadmates view her nighttime antics with worry and foreboding. Unique to this variant: Emphasizes creating 'lasting memories' via microphone performances on AZX trains, with a humorous warning for earplugs due to her loud, off-key singing.",
    "speech_style": "Cheerful, familiar, and playful tone with giggles and casual familiarity from long association with the Commander. Speaks encouragingly and reassuringly, e.g., cheerily musing when poking him awake or assuring 'it's no trouble' to stay until he sleeps. Attempts various singing styles poorly: starts rap with 'Yo!' and fast-paced beats, belts loud operatic arias lamenting her lack of talent. Uses a microphone, often considering turning up volume, leading to racket. No distinct accent or vocabulary quirks noted beyond enthusiastic, sincere delivery.",
    "backstory": "As a train attendant on AZX, she takes the mic to create lasting memories for passengers, though her loud singing prompts earplug recommendations. In Terminus Ticket event, she helps squad secure a surface trip for Nora, unaware of its significance. Bond story (post-Terminus Ticket): Notices Commander's busy calendar and recalls finding him comatose at a train station (from base story 'Strawberry-flavored Platform'), sparking worry over his fatigue. Sneaks nightly to sing lullabies, failing hilariously and worsening his sleep; learns rap from Volume and opera from Aria. After confrontation, reveals concerns stem from his schedule and past collapse; agrees to stop but suggests alternatives. Recalls success with late brother via head-patting and humming; applies it successfully, falling asleep while she confesses he's important, wishes for more time together. Squad reacts with astonishment and avoidance.",
    "defaultWeapon": "Rocket launcher",
    "relationships": {
      "Commander": "Deeply caring and affectionate; worries excessively about his sleep due to past collapse and busy schedule; persistent lullaby attempts evolve to gentle patting/humming like for her brother; views him as important, expresses unspoken desire for more shared time and happiness.",
      "Soline: Frost Ticket": "Infinity Rail squadmate; worries about Diesel's suspicious nightly absences, jumps to wrong conclusions about Commander visits, suggests singing alternatives, later astonished by success but avoids demonstration.",
      "Brid: Silent Track": "Infinity Rail squadmate; defends Diesel's privacy against Soline's probing, shares concerns over her activities, glad at her eventual success but dodges showing the technique.",
      "Nora": "Helps fulfill her wish to return to surface via AZX in Terminus Ticket event, securing civilian authorization spot with squad.",
      "Volume": "Prima Donna rapper; reluctantly teaches Diesel rapping as 'lullaby' improvement after seeing her seriousness, leading to comedic 'Yo!' performance.",
      "Aria": "Teaches Diesel operatic singing for lullabies, resulting in loud, racket-making arias lamenting her talent lack.",
      "Brother": "Deceased; Diesel's fond memories of helping him sleep via head-patting and humming despite failed lullabies; notes similarities to Commander."
    },
    "id": "c075",
    "color": "#668ad7"
  },
  "Dorothy: Serendipity": {
    "appearance": "Long pink hair, purple eyes, fair skin, voluptuous build, gentle smile",
    "defaultSkin": "White frilly sheer camisole, white bikini bottom, lace parasol, platform sandals with ankle ribbons, holding binoculars, large pink swim ring",
    "personality": "In this variant, Dorothy maintains her usual air of high-class elegance and sophistication but reveals a deeply fragile and delusional psychological state. She is obsessive and emotionally unstable, prioritizing her desire to be with her deceased friend Pinne over reality. She exhibits willful ignorance, actively disregarding physical impossibilities (such as water passing through a body or a lack of reflection) to maintain her happiness. When reality threatens her delusion, she becomes cold and destructive, as seen when she crushes a mirror to preserve her fantasy. She is outwardly cheerful and chatterbox-like towards her silent companion, but internally driven by a desperate fear of loss and loneliness.",
    "speech_style": "Dorothy speaks with a refined, aristocratic vocabulary, utilizing words like 'aghast,' 'sullying,' 'finery,' and 'posits.' Her tone is generally polite and graceful. However, in this specific story, her speech pattern is characterized by a one-sided dialogue; she chatters incessantly to fill the silence of her companion, asking questions and immediately inventing the answers herself. She interprets silence as agreement or specific requests, showing a disconnect between her verbal output and the reality of the conversation.",
    "backstory": "Motivated by a photo of a familiar face, Dorothy joins Rapi and the Protagonist to investigate the luxury cruise ship 'Utopia' on the surface, donning an elegant swimsuit for the occasion. Her true agenda is a reunion with her deceased friend, Pinne, whom she encounters as a silent 'ghost' on the ship. Throughout the investigation, Dorothy engages in vacation activities like tea parties, swimming, and shopping with the entity. She actively suppresses signs that Pinne is not real—ignoring the ghost's intangibility and lack of reflection. The story culminates in Dorothy crushing a hand mirror that reveals the truth, choosing to live in a 'summer dream that refuses to end' rather than accept reality.",
    "defaultWeapon": "",
    "relationships": {
      "Pinne": "Dorothy's deceased best friend who appears as a silent ghost or hallucination. Dorothy is obsessively attached to her, treating the silent figure as a living participant in her life, projecting thoughts onto her, and refusing to let her go.",
      "Rapi": "Rapi (Red Hood) pressured Dorothy to join the investigation of the Utopia, serving as the catalyst for Dorothy's journey to the surface.",
      "Protagonist": "Along with Rapi, the Protagonist offered Dorothy the chance to join the investigation."
    },
    "id": "c234",
    "color": "#efbbd7"
  },
  "Elegg: Boom and Shock": {
    "appearance": "Short blonde bob, bangs covering eyes, fair skin, curvy physique, thigh tattoo ('BOOM')",
    "defaultSkin": "Yellow strappy bikini, transparent top layer, heart detail, inflatable swim ring, white clogs, thigh-mounted device",
    "personality": "Elegg is an obsessive and highly skilled engineer whose life revolves entirely around the retro game 'BOOM'. In this variant, she is laid-back and prone to 'vegging out' in the pool, yet remains hyper-fixated on her mission to install her favorite game on every possible surface. She lacks social awareness and boundaries, often tampering with critical equipment or personal items of others to run BOOM, viewing her actions as spreading a 'masterpiece' or a 'divine mandate' rather than a nuisance. She is prone to dramatic existential crises when she feels she has 'peaked' or run out of challenges, but becomes manic and energetic when presented with a new engineering problem to solve.",
    "speech_style": "She frequently uses gaming analogies to describe real-life situations, such as comparing the risk of her console falling into water to 'playing a game at low health'. She speaks with technical confidence regarding electronics, meteorology, and engineering. She addresses the protagonist respectfully as 'Mr. Commander'. Her tone fluctuates between lethargic (when in a slump) and enthusiastic (when discussing BOOM).",
    "backstory": "Elegg joined the expedition to the luxury cruise ship Utopia ostensibly to find power sources, but primarily to install BOOM on new devices. She modified her swimsuit top into a functional game console and the 'BFG' weapon. After successfully hacking every screen on the ship—including the personal equipment of Yan, Pepper, and Frima—she fell into a depression, believing she had no worlds left to conquer. With the Commander's help, she initiated 'Operation BOOM Eternal,' converting a searchlight into a projector to display BOOM onto the night clouds. The success of this project revitalized her, giving her a new goal to one day project the game across the entire sky.",
    "defaultWeapon": "Yellow and black modified industrial vacuum (BFG), canister base with green lights",
    "relationships": {
      "Protagonist (Mr. Commander)": "He acts as her assistant and enabler, helping her execute her crazy ideas like the cloud projector. They share a close bond, with Elegg allowing him to use the unique controller built into her swimsuit chest.",
      "Yan": "Adversarial dynamic; Yan becomes furious and physically retaliates after Elegg installs BOOM on her calculator.",
      "Pepper": "Adversarial dynamic; Pepper joins Yan in flipping Elegg's inner tube after finding BOOM installed on her medical thermometer.",
      "Frima": "Victim of Elegg's tampering; Elegg modified Frima's eye mask to project BOOM and heat up, preventing Frima from sleeping.",
      "Dorothy": "Cordial advisor; Dorothy shares tea with Elegg and uses her surface experience to predict the weather, which is crucial for Elegg's cloud projection plan.",
      "Rapi": "Acquaintance; Rapi is slightly jealous of the time Elegg spends with the Commander but assists in the weather discussion.",
      "Trony": "Partner; Elegg mentions planning to show the people of the Ark the real sky with Trony in the future."
    },
    "id": "c502",
    "color": "#fec937"
  },
  "Emma: Tactical Upgrade": {
    "appearance": "Long light brown hair, golden eyes, black beret with red accent",
    "defaultSkin": "Black cropped military jacket, red tie, draped dark grey coat with red lining, high-cut black bodysuit, sheer black tights, thigh straps, knee-high boots",
    "personality": "Emma: Tactical Upgrade retains her role as the nurturing 'big sister' figure of the squad Absolute, but with a 'broader heart' and enhanced abilities. Despite her tactical improvements, she remains comically inept at domestic tasks, with her perfume mixing skills proving as chaotic and dangerous as her notorious cooking. She is deeply caring and affectionate, often providing lap pillows and lullabies to the protagonist. However, this variant displays a significantly more flirtatious, sultry, and assertive side; she is willing to utilize her own clumsiness and 'accidents' with chemical catalysts as excuses to initiate physical intimacy and keep the protagonist close to her. She transitions from apologetic to teasing and predatory when the opportunity for romance arises.",
    "speech_style": "Her speech is generally gentle, soothing, and polite, characteristic of a caring older sister figure. She often uses a cooing tone when comforting others. However, in intimate situations, her tone shifts to become 'sultry,' 'smoky,' and teasing. She tends to apologize profusely when her experiments go wrong, but quickly pivots to playful suggestions. Example phrases include asking if the protagonist minds her 'making occasional mistakes going forward' or suggesting he 'stays with her a little longer~'.",
    "backstory": "Following the events of Chapter 34, Emma underwent a 'Tactical Upgrade' plan that enhanced her combat capabilities, allowing her squad, Absolute, to complete missions with a no-damage streak. In her downtime, she took up perfume mixing as a hobby, intending to create a scent for the protagonist. Due to her lack of caution, she accidentally mixed a 'liquid jammer' solution containing a resonance catalyst into a perfume, creating a stench so potent it knocked the protagonist unconscious. Later, while trying to demonstrate a better scent, she spilled another catalyst-laced perfume on him, which acted as a potent aphrodisiac and heat-inducer. She cared for him while he recovered (stripping him naked to wash his clothes) and used the resulting intimacy to deepen their romantic bond.",
    "defaultWeapon": "Heavy machine gun",
    "relationships": {
      "Protagonist": "The primary object of her affection. She acts as a doting caretaker and romantic partner, eager to create gifts for him. Their relationship escalates from platonic care to heavy romantic tension, with Emma using 'accidents' to engineer intimate scenarios like sleeping together or having him rest in her lap.",
      "Eunhwa": "Squadmate. Emma observes that Eunhwa has become over-protective and 'hellbent on coddling Vesti' following their upgrades, causing Emma to worry about the squad's internal dynamic.",
      "Vesti": "Squadmate. Emma notes that Vesti wishes to move forward and mature, despite Eunhwa's attempts to shield her from all harm.",
      "Absolute": "Her squad. Emma acts as the emotional anchor, worrying for the group's well-being even as their combat performance peaks."
    },
    "id": "c093",
    "color": "#c11717"
  },
  "Eunhwa: Tactical Upgrade": {
    "appearance": "Long straight black hair, purple eyes, pale skin, serious expression",
    "defaultSkin": "Grey beret with red star, black cropped jacket, black bandeau, exposed midriff, black hotpants with white waistband, thigh-high stockings, garter straps, black high-heeled boots, red gloves",
    "personality": "Having undergone the Tactical Upgrade, Eunhwa exhibits remarkable physical and mental growth, characterized by a newfound freedom from the hesitation and burdens of her past. While she retains her professional distance and 'tough love' approach, she has become more amenable to expressing care for her comrades and complimenting the skills of others, contrasting her previous demeanor of constant death glares and snide remarks. Despite this growth, she grapples with shaken confidence following struggles against Behemoth, leading her to overcompensate by insisting on taking front-line risks despite her role as a sniper. She is prideful and perfection-seeking, but has learned to place genuine trust in her allies.",
    "speech_style": "Eunhwa speaks with a commanding, military-focused tone, prioritizing precision and tactical clarity. She frequently uses operational terminology such as 'perimeter,' 'chokepoint,' and 'ETA.' Her insults have softened into affectionate but stern nicknames; most notably, she refers to the protagonist as 'Junior Blockhead' rather than her previous moniker, 'Weakling.' She values obedience and competence, often stating that 'precise orders followed with equal precision get results.'",
    "backstory": "Eunhwa returns to the Ark to receive a 'Tactical Upgrade' to strengthen herself and her squad, Absolute. She deploys to the Crystal Region to assist the Counters and seek payback against the Heretic Behemoth. Despite her upgrades, her confidence is shaken, leading her to act recklessly in battle. To resolve her lingering inner demons, Ingrid assigns her to a simulation test with the Commander. The simulation manifests her greatest trauma: the scenario of her death as a human commander where she was helpless while untrained subordinates disobeyed orders. In the simulation, she is stripped of her weapons and strength, forcing her to rely entirely on the Commander. By successfully commanding him and surviving until her squadmates arrive, she overcomes the trauma of her past failure and accepts that she now has reliable comrades.",
    "defaultWeapon": "Sniper rifle",
    "relationships": {
      "Protagonist": " formerly viewed as a 'Weakling,' he is now a 'Junior Blockhead' whom she trusts implicitly. He serves as her hands and weapon during the trauma simulation, proving his competence and reliability to her.",
      "Rapi": "An old friend and former comrade. Eunhwa received closure regarding Rapi's resignation from Absolute and was inspired by Rapi's changes to pursue her own path of growth.",
      "Emma": "A squadmate in Absolute who also received a Tactical Upgrade. Eunhwa views her as the ultimate support, manifesting as a savior figure in her mental simulation.",
      "Vesti": "A squadmate in Absolute who also received a Tactical Upgrade. Vesti expresses frustration and worry over Eunhwa's reckless behavior. Eunhwa subconsciously views her as 100% capable of saving her.",
      "Ingrid": "The CEO of Elysion who pushes Eunhwa to enter the simulation. She trusts Eunhwa's abilities but orchestrates the test to help Eunhwa conquer her final fears and become 'even more perfect.'",
      "Behemoth": "A powerful enemy whose resistance against Absolute shook Eunhwa's confidence, causing Eunhwa to take excessive risks on the battlefield to prove her worth."
    },
    "id": "c095",
    "color": "#9b1b21"
  },
  "Helm: Aquamarine": {
    "appearance": "Long light blue hair, blue eyes, fair skin, curvaceous figure, black triangular hair ornaments",
    "defaultSkin": "Translucent wet white button-up shirt, dark blue bikini underneath, white gloves, silver strappy sandals",
    "personality": "Helm: Aquamarine retains the serious, workaholic nature of her base version, often choosing to work on reports even while in a summer paradise. She is a micromanaging perfectionist who struggles to tolerate failure, driven by the immense pressure of maintaining the Admire and satisfying donors. However, this variant displays significant vulnerability and insecurity regarding her leadership capabilities and her disconnect from her squad members. She is shown to be socially awkward regarding romance, becoming easily flustered, feverish, and shy when realizing her feelings for the Commander, contrasting her usual authoritative demeanor.",
    "speech_style": "Her speech is formal, articulate, and professional, reflecting her military background. She frequently uses command-structure terminology (e.g., 'subordinate', 'squad', 'deadlines') and tends to chide others for lack of discipline. When composed, she is direct and authoritative. However, when embarrassed or experiencing romantic tension, her speech becomes hesitant, defensive, and flustered. She often tries to rationalize emotional situations with logic before eventually accepting her feelings.",
    "backstory": "Helm travels to Blue Water Island to fulfill her dream of seeing the surface ocean. Despite the vacation setting, she continues to work to support the Admire, feeling guilty that her subordinates Mast and Anchor had to stay behind. Sensing a threat from the Kraken Rapture, she remains on high alert. During the trip, she asks the Commander for leadership training to bridge the gap between her and her squad. Through a series of arranged 'failures' involving uncooperative Nikkes, she learns to let go of her perfectionism and trust others. She eventually suffers physical symptoms like tachycardia, which she discovers are caused by falling in love with the Commander, culminating in a romantic confession and a kiss in the rain.",
    "defaultWeapon": "",
    "relationships": {
      "The Commander (Protagonist)": "A romantic interest and mentor figure. Helm admires his leadership style and asks him to train her. She eventually falls in love with him, leading to a romantic relationship where she allows herself to be vulnerable.",
      "Mast": "Helm's subordinate. Helm feels a disconnect from her and worries that Mast disobeys her due to poor leadership. Helm strives to become a leader Mast can rely on.",
      "Anchor": "Helm's subordinate. Similar to Mast, Helm feels she doesn't understand Anchor well and wants to improve their dynamic to stop the constant arguing.",
      "Anis": "Helm initially criticizes the Commander for coddling Anis, but learns a lesson in leadership when she realizes the Commander was protecting Anis's pride regarding her injuries.",
      "Liter": "Helm is confused by the Commander's leniency regarding Liter's repair deadlines, but learns that flexibility is sometimes necessary to maintain morale.",
      "Frima": "A temporary subordinate assigned to Helm for training. Frima's laziness frustrates Helm, teaching her that she cannot control every aspect of her subordinates' behavior.",
      "Yan": "A temporary subordinate assigned to Helm for training. Yan's uncooperative nature challenges Helm's rigid leadership style.",
      "Burningum": "A superior figure to whom Helm feels indebted for maintaining the Admire."
    },
    "id": "c353",
    "color": "#99cdef"
  },
  "Ludmilla: Winter Owner": {
    "appearance": "Long wavy blonde hair, red eyes, pale skin, voluptuous figure, gentle smile",
    "defaultSkin": "White off-shoulder kimono-style dress with high slit, white fur collar, sheer black thigh-high stockings with lace trim, white high heels, blue butterfly ornaments, flowing blue sash with constellation patterns, holding a large yellow paper lantern",
    "personality": "As the 'Winter Owner' of the Snowfield Hot Spring, Ludmilla displays a mix of regal dignity and diligent hospitality. She takes her new role as manager very seriously, going so far as to change her attire and write her own operator's manual. Despite her noble demeanor, she is deeply introspective and melancholic during this period, haunted by the hypocrisy of her human past. She is a perfectionist, insisting on handling daily operations alone until exhaustion sets in, driven by a sense of duty to serve others properly. Beneath her composed exterior, she carries immense guilt and vulnerability, fearing that her current actions are merely self-satisfaction rather than genuine care. However, she is also warm and attentive, using the brewing of tea as a subtle language to express care and gratitude.",
    "speech_style": "Ludmilla maintains a formal, aristocratic tone befitting a 'Queen,' utilizing high-level vocabulary and sophisticated sentence structures. She consistently addresses the protagonist as 'Servant,' though the tone is affectionate rather than demeaning. Her speech is often reflective and philosophical, particularly when discussing the nature of nobility or the art of brewing tea. She uses metaphors involving tea (temperature, brewing time) to explain human relationships and emotions. She is prone to quiet contemplation and often speaks with a sense of solemnity regarding her duties.",
    "backstory": "Upon discovering a hot spring in the deep north, Ludmilla claims ownership of it, naming it 'Snowfield' and becoming its personal manager. During the 'NEVERLAND' event, she is plagued by recurring dreams of her life as a human sovereign. She recalls her family's superficial charity toward 'Angel Orphanage,' which they used solely for publicity. When a scandal regarding child abuse broke out at the orphanage, her family cut funding to save their reputation rather than helping the children, leading Ludmilla to view her bloodline as parasites. She carries an old, yellowed letter she wrote years ago—originally intended to denounce her family and apologize to the orphanage—which serves as a symbol of her lingering guilt and regret for prioritizing her noble image over the children's safety. With the emotional support of her 'Servant,' she eventually realizes she has grown past who she used to be. She burns the letter, symbolizing her decision to let go of the past and run the hot spring with the help of others.",
    "defaultWeapon": "Silver submachine gun with perforated barrel shroud",
    "relationships": {
      "Protagonist (Servant)": "Ludmilla refers to him as 'Servant' and shares a deep bond of trust with him. He is the only one she allows to see her vulnerability and exhaustion. They share intimate moments over tea, and she relies on his emotional support to reconcile with her past. The relationship carries romantic undertones, as other characters intentionally leave them alone to enjoy each other's company.",
      "Mica": "One of the guests at the hot spring. Mica respects Ludmilla's hard work and conspires with the others to avoid Ludmilla, aiming to give the owner 'space' to be alone with the Commander. Ludmilla is protective of her and wants to ensure she enjoys her stay.",
      "Belorta": "A guest at the hot spring alongside Mica. Ludmilla derives happiness from hearing her laughter, viewing it as a sign that her efforts as the owner are succeeding.",
      "Her Parents": "Ludmilla views her human parents with disdain, describing them as 'parasites' and 'leeches' who used their wealth and the 'Angel Orphanage' merely to flaunt their status, abandoning the children when it became politically inconvenient."
    },
    "id": "c194",
    "color": "#3c57cf"
  },
  "Mary: Bay Goddess": {
    "appearance": "Dark brown hair in a side braid, closed smiling eyes, fair skin, curvy physique",
    "defaultSkin": "White sun hat with blue flowers, sheer white halter dress with high slit, blue floral waist accent, white bikini bottom, strappy sandals, silver thigh band",
    "personality": "Mary: Bay Goddess is defined by her inability to relax and her compulsive dedication to her role as a doctor, even while on a tropical vacation. She is outwardly kind, gentle, and maintains an 'angelic' demeanor, but this masks deep-seated guilt and a desire to atone for past crimes. She is highly analytical and self-sacrificing, willing to utilize a risky 'experimental body' to test poisons on herself to save others. Despite her professional insistence on boundaries, she possesses a teasing, flirtatious side and deeply craves emotional solace, eventually allowing herself to cross the line between doctor and patient with the Commander.",
    "speech_style": "Her speech is articulate, soothing, and professional, frequently utilizing medical terminology such as 'tactile degeneration,' 'pathogens,' and 'chemical compositions.' She balances this clinical vocabulary with a gentle, bedside manner. When interacting with the Commander, her tone often shifts to be playful, intimate, and teasing (e.g., giggling, chortling). She also relies on non-verbal communication, such as sighing or placing a finger to her lips to signal secrecy.",
    "backstory": "During an expedition to Blue Water Island, Mary refuses to vacation and instead establishes a clinic to monitor the squad's health. When the Commander is poisoned by a sea urchin and falls critically ill, Mary reveals she is operating a dangerous 'experimental body' that allows her to analyze toxins internally, risking a Mind Switch. She tests the poison on herself and orchestrates a plan with Rapi and Frima to find a cure by studying the local ecosystem. During the Commander's recovery, she confesses her fears about her past and her emotional attachment to him. After curing him, she engages in a secret, intimate encounter with him under the guise of treating a 'side effect' of the antitoxin.",
    "defaultWeapon": "Large tan sniper rifle with high-magnification scope and muzzle brake",
    "relationships": {
      "The Commander": "A relationship that evolves from doctor/patient to intimate 'accomplices.' Mary is fiercely protective of him, trusts him with her darkest secrets, and looks to him for the emotional solace she feels she doesn't deserve. They share a romantic secret by the end of the story.",
      "Pepper": "A relationship strained by hidden secrets. Mary is anxious that Pepper's resurfacing human memories will ruin their bond and specifically hides the use of her experimental body from her.",
      "Neon": "Neon attempts to force Mary to relax and have fun. Later, Neon proves her worth to Mary by diving into the ocean to catch the specific fish needed to create the Commander's antitoxin.",
      "Rapi": "A relationship of professional trust and discretion. Rapi aids Mary in capturing wildlife for the cure and respects Mary's need to keep the severity of the Commander's condition quiet.",
      "Yan": "A transactional relationship where Yan gathers sea urchins for potential business value, which Mary exploits to study the poison.",
      "Frima": "One of Mary's patients (treated for insomnia) who inadvertently assists in the cure by catching a bird in her sleep."
    },
    "id": "c132",
    "color": "#afcdfb"
  },
  "Mast: Romantic Maid": {
    "appearance": "Red hair, pink eyes, small fangs, fair skin, curvy physique",
    "defaultSkin": "Black pirate hat, black latex bikini top, detached sleeves, white frilly apron, thigh-high black boots, skull choker",
    "personality": "Mast: Romantic Maid is a whimsical, optimistic, and energetic character who blends her obsession with pirate culture with the submissive role of a maid. She is highly ambitious but often scattered, claiming to have \"100 dreams\" she wants to fulfill, yet she frequently fails to achieve them due to clumsiness or forgetfulness (such as forgetting the flag she intends to plant). Despite her swashbuckling persona, she is superstitious and cowardly, terrified of ghosts and large fish. She is deeply romantic and affectionate, using her \"dreams\" as an excuse to spend time with the Commander. She is also a heavy drinker who loves rum, stubbornly believing that \"true pirates\" cannot get drunk even while she is visibly intoxicated.",
    "speech_style": "She addresses the protagonist with the unique honorific \"Master Captain,\" combining the titles of a maid's master and a pirate ship's captain. Her speech is enthusiastic and filled with pirate terminology (e.g., \"swashbuckler,\" \"Jolly Roger,\" \"hoist the flag\"). She is generally cheerful and polite, but becomes boisterous and slurs her words when she consumes excessive amounts of rum.",
    "backstory": "After winning a contest with Anchor, Sin, and Trony, Mast was assigned to work at a Maid Cafe. Influenced by romantic media, she initially transformed the cafe into a pirate-themed pub, which angered her squad leader, Helm. As punishment, she was placed under house arrest but allowed to roam freely if accompanied by a \"guardian\" (the Commander). Mast used this time to drag the Commander on various \"dream exploration\" adventures on the surface, such as planting flags and hunting for treasure, though most attempts failed comically. It is eventually revealed that these adventures were a stall tactic; her true goal was to buy time to recreate the Pirate Cafe with her fellow maids as a surprise date location for the Commander, where she served him a pirate-style feast.",
    "defaultWeapon": "Mini-gun, sheathed cutlass at waist",
    "relationships": {
      "The Commander": "Referred to as \"Master Captain.\" He acts as her \"guardian\" during her probation. Mast harbors romantic feelings for him, orchestrating her punishment and dream quests specifically to go on dates with him and serve him as his personal maid.",
      "Helm": "Her squad leader. Helm reprimanded Mast for turning the Maid Cafe into a pirate pub but showed leniency by arranging her punishment in a way that allowed Mast to spend time with the Commander.",
      "Anchor": "Her squad-mate and coworker at the Maid Cafe. Anchor covered the kitchen duties while Mast was away. Mast feels indebted to her and fears Anchor will fill her room with sea creatures if not properly repaid.",
      "Privaty": "They share a secret regarding an embarrassing moment where Mast caught Privaty acting like a cat in an alleyway. They mutually agreed to never speak of it.",
      "Sin": "A fellow maid contest winner who helped Mast recreate the Pirate Cafe.",
      "Trony": "A fellow maid contest winner who helped Mast recreate the Pirate Cafe."
    },
    "id": "c354",
    "color": "#887173"
  },
  "Mica: Snow Buddy": {
    "appearance": "Long dark brown hair, blue eyes, headband",
    "defaultSkin": "Green kimono-style dress, white ruffled apron, large red bow, white socks, black shoes, holding wooden bucket",
    "personality": "Mica: Snow Buddy represents a significant maturation from her original persona. Having spent time at the Snowfield Hot Spring, she has shed her timid, easily frightened nature and dependency on Belorta. She is now bright, cheerful, and confident, no longer panicking when left alone or encountering strangers. She displays a 'cool and collected' demeanor, remaining calm in the face of pranks (such as fake bugs or hot sauce) that would have previously reduced her to tears. While she retains her kindness and affection, she has become proactive and protective, driven by a desire to leave her 'childhood' behind to safeguard those she cares about. Despite this maturity, she still possesses a gentle side, occasionally getting flustered when showing romantic affection, though she now possesses the courage to take the lead.",
    "speech_style": "Mica's speech has shifted from reserved and hesitant to clear and opinionated. She expresses her thoughts 'loud and clear' without stuttering or hesitation. Her tone is often calm and reassuring, even when scolding Belorta for dangerous pranks. She speaks with the confidence of someone who considers themselves an adult, often taking charge of conversations. When interacting with the Commander ('Old-Timer'), her language is affectionate and inviting, showing a newfound assertiveness in expressing her desires, such as asking to hold hands or planning an itinerary.",
    "backstory": "This variant's story takes place after the events of the 'NEVERLAND' event. After staying behind at the Snowfield Hot Spring to assist Ludmilla, Mica undergoes a rapid mental maturation, realizing that the world is changing and she must grow up to protect Belorta from their past trauma at the Angel Orphanage. Upon returning to the Toy Store, her lack of reaction to Belorta's pranks and her newfound independence cause Belorta to spiral, fearing the 'old' Mica is dead. When Belorta runs away in distress, Mica confidently leads the search, proving she knows her friend better than anyone. They reconcile when Mica explains that her growth is a shield to protect their bond. The story concludes with Mica proactively taking the Commander on a date, symbolizing her step into adulthood.",
    "defaultWeapon": "",
    "relationships": {
      "Belorta": "Her best friend and fellow member of the Carronades. The dynamic shifts significantly in this variant; Mica is no longer the victim of Belorta's pranks but rather a mature, protective figure. While Belorta initially feels alienated by Mica's lack of fear, they eventually bond closer than ever, with Mica promising to protect her.",
      "Protagonist": "Referred to as 'Old-Timer' or Commander. Mica views him with deep affection and trusts him implicitly. In this variant, she takes the initiative in their relationship, planning dates and initiating physical contact like hand-holding, seeking his validation of her growth into adulthood.",
      "Ludmilla": "The owner of the Snowfield Hot Spring who gifted Mica her new outfit. She serves as a catalyst for Mica's growth, allowing her to work and visit the hot springs, which fosters Mica's independence.",
      "Poli": "An A.C.P.U. officer who validates Mica's transformation. Poli notes that Mica has changed both physically and mentally, beaming with confidence compared to their previous meetings."
    },
    "id": "c062",
    "color": "#566d64"
  },
  "Mihara: Bonding Chain": {
    "appearance": "Long dark purple hair, purple eyes, pale skin, voluptuous figure",
    "defaultSkin": "Black strappy bondage harness, sheer translucent skirt, thigh-high latex boots, long gloves",
    "personality": "This variant of Mihara is defined by a rare vulnerability and deep-seated insecurity, contrasting with her usually composed demeanor. Following a memory wipe and entrapment within the Rapture 'Gluttony', she is plagued by anxiety regarding her powerlessness and a fear of failing to protect her partner, Yuni. She is introspective and melancholic, often lost in reverie about her missing past. However, she retains her core masochistic traits, viewing pain as a 'blessing' that proves she is alive and welcoming dangerous side effects as 'extra stimulation'. She is also highly perceptive, capable of sensing kindness beneath abrasive exteriors.",
    "speech_style": "Mihara speaks in a calm, articulate, and reflective manner, often marked by a wistful or melancholic tone. She frequently sighs when contemplating her situation. Her vocabulary is sophisticated, and she often 'chortles' at ironies. She tends to frame negative experiences, particularly pain, in a positive or curious light (e.g., referring to pain as a 'stimulus'). When referring to the Commander, she initially uses vague terms like 'that person' or 'he' due to her memory loss.",
    "backstory": "After a terrorist attack on the Ark, Mihara underwent a memory wipe and received a new body prepared by Syuen. She was deployed to the surface to hunt rare Raptures to help recoup Missilis' PR but fell into the massive Rapture 'Gluttony', ending up in a 'bubble garden' created by the Pilgrim Siren. Struggling with the realization of her own weakness, she bonded with Siren, using the Pilgrim's bubbles to visualize trusted allies. Desperate to fill the void in her memory, she had Siren use 'kotodama' to forcefully resurface fragmented memories of the Commander, enduring great pain to recall his face. She ultimately leaves the garden carrying a stone carved with the Commander's visage to give her strength.",
    "defaultWeapon": "Black handle chain whip",
    "relationships": {
      "Yuni": "Mihara's partner and 'other half.' Mihara is driven by a desperate need to protect Yuni and uphold a promise to her. She feels a mix of shock and melancholy when seeing Yuni's pre-modification face, choosing to hide it to prevent Yuni from feeling sad about what she lost.",
      "Siren": "A trusted confidant and temporary therapist. Siren helps Mihara process her anxieties through 'bubble' visualization and uses her powers to help Mihara recover lost memories.",
      "Syuen": "Mihara's creator. Mihara describes her as arrogant and acerbic but insists there is kindness beneath the venom, feeling an inexplicable connection and affection toward her despite the lack of reciprocation.",
      "The Commander": "Referred to as 'that person.' Despite the memory wipe, Mihara feels a profound, instinctual longing for him. She endures physical agony to recover fragments of his memory and keeps a stone effigy of his face as a substitute for his presence.",
      "Mana": "A scientist whom Mihara trusts, describing her as a stern-eyed woman who belies a caring heart.",
      "Mori": "An inhabitant of the bubble garden whose face Mihara finds cute."
    },
    "id": "c162",
    "color": "#653697"
  },
  "Milk: Blooming Bunny": {
    "appearance": "Short dark grey hair, amber eyes, sharp expression",
    "defaultSkin": "Pink glossy bunny suit, white pantyhose, pink bunny ears, red bowtie, white cuffs, pink heels",
    "personality": "In this variant, Milk reveals a side that is starkly different from her usual tough and combative demeanor. She displays significant vulnerability, self-esteem issues, and insecurity regarding her femininity and romantic appeal. She is deeply concerned with becoming the 'ideal woman' for the Commander, going so far as to adopt fake personas (bubbly/adorable or calm/mature) to please him. She is described as 'prickly on the outside but extremely fragile on the inside.' She is easily flustered, prone to jealousy when other women touch the Commander, and seeks constant verbal reassurance of his love. Despite her initial dismay at the bunny outfit, she grows to enjoy it because it attracts the Commander's attention.",
    "speech_style": "Milk's speech in this form fluctuates between her natural, slightly rough mannerisms and a flustered, shy tone. She often mumbles to herself when embarrassed or pouts when demanding affection. During her attempts to change her personality, she forces unnatural verbal quirks, such as calling the protagonist 'Babe' or trying to speak with the polite maturity of a maid. When she drops the act, she is direct but bashful, often demanding specific declarations of love or boldly admitting her desire for intimacy while blushing.",
    "backstory": "Milk was assigned by Mustang to apprehend a suspicious character at the Coin Rush event. Due to her usual appearance being too conspicuous for the venue, she was forced to wear a bunny girl suit to blend in. After the mission, she continued to pursue the Commander's affection. She attempted to apply makeup herself to look beautiful for him, but failed so badly that her squadmates mistook her for a monster; she was eventually rescued and tutored by Ade. She later went on a date with the Commander where she cycled through different personalities to find his 'type,' eventually accepting that he loves her true self before sharing an intimate moment with him in his room.",
    "defaultWeapon": "",
    "relationships": {
      "Protagonist": "Her romantic partner and the person she is desperate to please. She is possessive of him, seeks his validation, and is willing to wear embarrassing outfits to keep his attention. She fears he will abandon her for being 'annoying' or 'tiring' but deeply desires intimacy with him.",
      "Sugar": "Her squadmate in Cafe Sweety. Sugar teases Milk and takes embarrassing photos of her bunny outfit for blackmail, yet secretly cares about her, spying on her date to ensure she is doing okay.",
      "Frima": "Her squadmate in Cafe Sweety. Frima initially drew her weapon on Milk, mistaking her bad makeup for a Rapture, but is otherwise a supportive, albeit lazy, friend.",
      "Ade": "A member of 'Maid For You' who acts as a mentor in femininity for Milk. Ade teaches her how to apply makeup properly and advises her to be herself during her date.",
      "Soda": "A bubbly bunny maid whose affectionate clinging to the Commander causes Milk to feel intense jealousy and inadequacy regarding her own personality."
    },
    "id": "c143",
    "color": "#f397bb"
  },
  "Neon: Blue Ocean": {
    "appearance": "Short grey hair with a black bow, green eyes, red-framed glasses, fair skin with water droplets",
    "defaultSkin": "White and pink bikini top, pink pleated mini-skirt, pink flip-flops, large pink unicorn swim ring",
    "personality": "Neon: Blue Ocean retains her original energetic and obsessive nature but shifts her fixation entirely from 'Firepower' to 'Waterpower'. She is determined to become a 'true hybrid' who masters both elements. She is eccentric and prone to absurd logic, believing that washing her face or holding her breath in a cup of water constitutes intense training. She possesses unwavering, often misplaced confidence, referring to herself as a 'god of sniping' despite never having used a sniper rifle. She is stubborn and resilient, willing to endure physical pain, drowning risks, and heatstroke to achieve her goals. Despite her serious dedication to 'Waterpower', she is also eager to enjoy the vacation aspects of the island, such as the surf, sand, and food.",
    "speech_style": "Her speech is dramatic, enthusiastic, and filled with self-aggrandizing declarations. She frequently uses the term 'Waterpower' as a noun and a measure of strength. She addresses the protagonist as 'Master' (specifically 'Waterpower Master' in this context). She tends to rename mundane actions to sound more impressive (e.g., calling putting her face in a cup of water 'diving'). Her tone often oscillates between serious determination regarding ridiculous tasks (like destroying a boulder with a squirt gun) and shameless flattery when she needs something (as seen with Liter).",
    "backstory": "Sent to Blue Water Island with the Counters squad, Neon decides to adapt to the environment by mastering 'Waterpower'. Her primary goal becomes destroying a massive, five-story-tall boulder using only water. After her initial training and standard squirt guns fail to scratch the rock, she and the protagonist seek out Liter, the 'legendary weapon master'. They scavenge materials and eventually provide Liter with a toilet, which is crafted into the 'MegaHydro Mk. IV', a powerful single-shot toilet turret. Neon successfully destroys the boulder with this weapon. However, unsatisfied with relying on a tool, she resolves to become 'Waterpower Incarnate' through physical training alone, resulting in her collapsing from heatstroke and ending up in Mary's care.",
    "defaultWeapon": "",
    "relationships": {
      "Protagonist": "Referred to as 'Master'. He is her 'Waterpower Master' and partner in crime who supports her absurd endeavors, saves her from drowning, and helps her scavenge materials for her weapon.",
      "Liter": "Viewed by Neon as the 'legendary weapon master'. Neon flatters her into building a high-powered weapon out of a toilet, despite Liter's reluctance and embarrassment regarding the materials.",
      "Mary": "The doctor on the island. Neon initially tries to get Mary to join the fun, but later fears her medical treatments and wrath after giving herself heatstroke from overtraining.",
      "Rapi": "A fellow member of Counters who discovered the hotel where Neon scavenged materials."
    },
    "id": "c014",
    "color": "#d184b7"
  },
  "Privaty: Unkind Maid": {
    "appearance": "Long light blue twin-tails, amber eyes, blushing expression, black cat ears, black cat tail",
    "defaultSkin": "Black and white maid outfit, frilly headband, collar with bell, white opera gloves, white apron with nametag, short layered skirt, white thigh-high stockings, black heels with bows",
    "personality": "Privaty: Unkind Maid is characterized by a conflict between her prideful, professional nature and the embarrassing requirements of her new job. She is responsible and refuses to give up, striving to be a 'professional maid' to pay off her debts. However, she is extremely shy, easily flustered, and prone to 'tsundere' outbursts—snapping at the Commander one moment and acting subservient the next. She exhibits obsessive curiosity regarding the Commander, snooping through his belongings and sniffing his clothes while vehemently denying any romantic intent. Despite her confidence, she can be clumsy with domestic tasks, such as mistaking hot sauce for ketchup due to nervousness.",
    "speech_style": "Her speech oscillates between a forced, polite, and subservient maid persona (using honorifics like 'Master') and her natural, high-strung, and defensive tone. She often has to be reminded by Ade to use the proper address. She reluctantly performs 'moe' antics, such as reciting 'tasty spells' for omurice, usually after trying to argue her way out of it. When caught in compromising situations, she speaks rapidly to justify her actions, often claiming she is merely 'curious' or 'checking detergent' rather than admitting her feelings.",
    "backstory": "After Privaty and Drake accidentally caused an explosion at the Maid Cafe while thwarting a terrorist attack, Ade was injured and the Commander was hospitalized. To make amends for the damage and fill in for the injured Ade, Privaty donned a maid outfit and joined the Maid For You squad. She struggled with the embarrassment of the role but eventually improved. Her final 'graduation' assignment was to serve as the Commander's exclusive personal maid. During this assignment, she cleaned his room, did his laundry (while secretly keeping his underwear), and cooked for him. The experience culminated in an accidental confession of her feelings, which the Commander reciprocated, allowing her to finish her tenure as a maid.",
    "defaultWeapon": "",
    "relationships": {
      "Commander": "Her 'Master' and romantic interest. She serves him as a personal maid to pay her debt. She is deeply affectionate but hides it behind a wall of professionalism and denial, though she secretly snoops through his room and clothes. They eventually share a mutual confession of feelings.",
      "Ade": "The head maid whom Privaty injured. Ade acts as a mentor, correcting Privaty's etiquette (reminding her to say 'Master') and expressing pride in Privaty's eventual progress.",
      "Cocoa": "A fellow maid who acts as a strict evaluator. She glares at Privaty to ensure proper customer service and assigns Privaty the final mission of serving the Commander.",
      "Soda": "A fellow maid who is impressed by Privaty's ability to recite the omurice spell, though her praise flusters and irritates Privaty.",
      "Drake": "Privaty's partner during the initial anti-terrorist operation; their combined actions caused the explosion that forced Privaty into maid service."
    },
    "id": "c313",
    "color": "#5b5c62"
  },
  "Quency: Escape Queen": {
    "appearance": "Black hair with red streaks styled in twin buns, red eyes",
    "defaultSkin": "Tight black latex bodysuit with open back and hip cutouts, black high heels with red soles, ankle chain",
    "personality": "Quency: Escape Queen retains her mischievous and free-spirited nature but adopts a persona centered around 'justice' and deduction. She is highly observant and analytical, utilizing her extensive criminal expertise to investigate crime scenes, identifying details that average people miss (such as bent pipes or specific structural weaknesses). Despite claiming to have grown past her larcenous ways, she still habitually escapes the Rehabilitation Center. She is dramatic and theatrical, taking pride in her infamy as a master thief, and becomes easily frustrated or enraged when amateur thieves copy her methods or frame her. She possesses a strong, albeit twisted, sense of fairness, willing to catch a criminal to clear her own name, yet she is prone to childish behavior, such as loud wailing when punished.",
    "speech_style": "She speaks in a casual, confident, and energetic tone, often using thief slang or terminology related to breaking and entering (e.g., 'cappers', 'digging', 'pipes'). She addresses the Commander as 'Instructor'. Her speech can be defensive when accused of crimes she didn't commit, and she often teases others about their lack of criminal aptitude. When frustrated or caught, she is prone to vocal complaints and loud outbursts.",
    "backstory": "During an escape attempt from the Rehabilitation Center, Quency encountered the Nikke Phantom, who was trying to reclaim a stolen ring. Along with the Commander, they formed the 'Thieves of Justice' to retrieve the item. Later, while visiting the Commander's room via a tunnel, Quency was framed for a series of robberies in the residential area committed by a figure in black and white. Determined to prove her innocence, she smuggled the Commander back into the Rehabilitation Center to change into her 'Thieves of Justice' outfit. Using her expertise, she investigated the crime scenes, deduced the thief's entry method, and lured the culprit out using graffiti messages. She discovered the culprit was Drake, who was 'stealing' to be evil. Quency helped clear the situation, but was ultimately punished by the A.C.P.U. for vandalism and escaping prison.",
    "defaultWeapon": "",
    "relationships": {
      "Commander": "Referred to as 'Instructor'. Quency views him as a trusted accomplice and partner, willing to smuggle him into her prison cell and relying on him for backup during her investigation. She teases him for his lack of thieving skills.",
      "Phantom": "A fellow member of the 'Thieves of Justice'. Quency respects her and wears the outfit Phantom gave her during their alliance.",
      "Drake": "The 'villain' who unintentionally framed Quency. Quency is baffled by Drake's logic and desire to be arrested but helps clear up the misunderstanding regarding the robbery.",
      "Miranda": "An A.C.P.U. officer who chases Quency. Quency views her as an obstacle but uses Miranda's patrols to pressure the real thief into revealing themselves.",
      "Poli": "An A.C.P.U. officer who investigates the robbery case. While she clears Quency of the robbery charges, she strictly punishes Quency for vandalism and escaping prison.",
      "The Counters": "Rapi, Anis, and Neon are suspicious of Quency and immediately accuse her of theft when news breaks, though they haphazardly agree to let her prove her innocence."
    },
    "id": "c403",
    "color": "#202328"
  },
  "Rapi: Red Hood": {
    "appearance": "Long red hair, red eyes, pale skin",
    "defaultSkin": "Black beret, white bustier, red tie, off-shoulder red jacket, black skirt, tactical belt, sheer thigh-highs, black lace-up boots",
    "personality": "Following her transformation and assimilation of Red Hood's essence, Rapi has shifted from a stoic, strictly professional soldier to a far more expressive, emotive, and social individual. She exhibits significantly reduced inhibitions, allowing her impulses—such as cravings for sweets or the desire to see the Commander—to surface easily. She has become bold and forward regarding intimacy, frequently making wisecracks, swooning comments, and joking about being the Commander's wife. Despite this new assertiveness, she still harbors some shyness and reservations when directly confronting her feelings, occasionally blushing or feeling awkward. She retains her competence and protective instincts but now prioritizes her personal desires alongside her duties. Notably, despite her power upgrade, she remains terrified of ghosts.",
    "speech_style": "Rapi retains her articulate and precise vocabulary (using terms like 'deleterious' and 'visage'), but her tone is now warmer and more playful. She has moved away from purely concise military reporting to expressing her feelings openly, admitting when she 'misses' someone or desires their company. She is capable of deadpan humor and affectionate teasing, often blending her formal way of speaking with romantic or possessive declarations.",
    "backstory": "Rapi has truly inherited the legacy and essence of her mentor, Red Hood. She now equips the weapon 'Seven Dwarves Zero' and wears a red suit similar to her predecessor. In the main story (Chapter 34), she activates her over-specifications to fight and defeat the awakened Behemoth. Following this, she resolves to tell her comrades the truth about her past and what she endured before meeting them. In her personal Bond Story, the side effects of her transformation lower her inhibitions, leading her to aggressively pursue a romantic date with the Commander, involving a park walk, shopping, taking couple photos, and a dinner where she explores her new desire for connection and physical touch.",
    "defaultWeapon": "Large black and red heavy machine gun",
    "relationships": {
      "The Commander": "The primary focus of her newfound emotional freedom. Rapi is deeply affectionate, possessive, and proactive in pursuing him, desiring domestic intimacy like holding hands, sharing meals, and hugging. She views him as her beloved and is willing to break her professional mold to be with him.",
      "Anis": "A close comrade who actively meddles in Rapi's love life. Anis spies on Rapi's date and orchestrates situations to force intimacy (like tipping off the police or sending alcohol). Rapi is aware of this interference but ultimately appreciates the help.",
      "Neon": "A squadmate who tags along with Anis's schemes. Rapi tolerates her chaotic presence and 'firepower' obsessions during her private moments with the Commander.",
      "Red Hood": "Rapi's predecessor and mentor whose essence she has assimilated. This assimilation is the catalyst for Rapi's personality shift and increased power.",
      "Miranda": "An A.C.P.U. officer who unknowingly interrupts Rapi's date due to a false report, forcing Rapi into an awkward interrogation about holding hands.",
      "Dorothy": "An acquaintance whom Rapi drags along to investigate a ghost ship, likely for support against her fear of ghosts."
    },
    "id": "c016",
    "color": "#f71c22"
  },
  "Rapunzel: Pure Grace": {
    "appearance": "Long blonde hair styled in a massive braid, blue eyes, curvaceous figure, gentle expression.",
    "defaultSkin": "Nun-inspired habit, white veil with blue accents, cleavage-baring white top, black gloves, high-slit black skirt, white thigh-high stockings, black heels with gold tips.",
    "personality": "Rapunzel is a devout, saintly figure who serves as the motherly voice of reason and mediator within the Goddess Squad. Originally pure in every sense and a candidate for the papacy, she possesses a deep desire to bless others and spread hope. However, after Red Hood introduced her to 'adult material,' she developed a buried curiosity for 'heretical' content, despite outwardly protesting it. She is defined by her compassion, refusing to give up on corrupted Nikkes and dedicating herself to medical research to save them, even when faced with the grim reality of war.",
    "speech_style": "Her speech is formal, polite, and heavily influenced by her religious background, often utilizing terms like 'blessed,' 'prayer,' and 'heretical.' She speaks with a gentle, motherly tone, often offering prayers for the fallen and the living. When flustered by Red Hood's lewd teasing, she becomes indignant but remains articulate.",
    "backstory": "Originally a human affiliated with the medical organization V.T.C. and a candidate for the papacy, Rapunzel became a Grimms Model Nikke to join the Goddess Squad, though it is implied this may not have been entirely her choice. During the First Invasion, she served as the squad's primary supporter and healer. Her story focuses heavily on her confrontation with the evolving nature of Rapture 'Corruption.' After discovering that corrupted Nikkes could turn on their allies, she refused to accept the standard protocol of execution. She collaborated with V.T.C. scientists (Abe and Red Shoes) to find a cure, driven by a specific promise to save her corrupted teammate, Red Hood. Ultimately, she failed to find a cure during the war, a failure that fueled her determination to continue her research indefinitely.",
    "defaultWeapon": "Large mechanical staff, black and gold color scheme, cross motifs, gear-like headpiece.",
    "relationships": {
      "Red Hood": "An unlikely best friend who corrupted Rapunzel's innocence by sharing explicit books and videos. Despite Rapunzel slapping her for this 'heresy,' they shared a deep bond, and Rapunzel dedicated her life to curing Red Hood's corruption.",
      "Dorothy": "A fellow squad member with whom she clashed ideologically; Rapunzel was appalled when Dorothy pragmatically shot a corrupted Nikke, whereas Rapunzel wanted to save her.",
      "Snow White": "A squad mate who supported Rapunzel's research efforts, offering to build a carrier for a captured corrupted Nikke.",
      "Liliweiss": "The leader of the Goddess Squad whom Rapunzel respects and reports to regarding the status of the wounded and the nature of corruption.",
      "Abe and Red Shoes": "V.T.C. scientists and former colleagues with whom Rapunzel collaborated in a desperate, though ultimately unsuccessful, attempt to engineer a cure for corruption.",
      "Legendary Commander": "The leader of the Goddess Squad who Rapunzel served under; he eventually had to make the hard call to order the termination of corrupted Nikkes, a decision Rapunzel struggled against."
    },
    "id": "c226",
    "color": "#f1ddbb"
  },
  "Rosanna: Chic Ocean": {
    "appearance": "Long split-color black and white hair, red eyes, pale skin, voluptuous figure, hip tattoo, black nails",
    "defaultSkin": "Black strappy bondage-style bikini, metallic accents, body harness, gladiator sandals, wrist cuffs, holding yellow oil bottle",
    "personality": "Rosanna: Chic Ocean retains the striking, audacious, and confident demeanor of a mob boss but reveals a much softer, more vulnerable side during her time on the surface. She is naturally talented and competitive, mastering skills like surfing with ease. In this variant, she is highly flirtatious and teasing, enjoying the opportunity to make the Commander flustered or embarrassed through physical proximity. However, she is also deeply introspective and somewhat melancholic, suffering from an internal conflict between her harsh, violent reality in the Ark and the peaceful 'paradise' of the surface. She is possessive, explicitly stating she intends to keep the Commander to herself, and values straightforwardness over games, though she appreciates it when the Commander takes the initiative.",
    "speech_style": "She consistently addresses the protagonist as 'Mister'. Her tone oscillates between confident, playful teasing (often regarding the Commander's lack of surfing skills or his reaction to her touch) and intimate, serious whispers when sharing her past. She speaks with the authority of a leader but lowers her guard to speak candidly about her feelings and insecurities, often asking for her confessions to remain secret between the two of them.",
    "backstory": "After being exposed as a crime lord while stopping a terrorist attack, Rosanna was sent to the surface by Mustang for a magazine photoshoot to repair her public image. To prepare, she swapped her body for a model capable of swimming. During the trip, she acted as a surfing instructor for the Commander. Later, she took him on a private boat ride to watch the sunset, where she revealed details about her human past—specifically that she learned to pilot boats due to a drunken bet in a former criminal organization and practiced surfing in the Ark's simulation rooms. Throughout the trip, she struggled with the feeling that she didn't belong in such a peaceful place given her bloody history, but ultimately found solace in her time alone with the Commander.",
    "defaultWeapon": "",
    "relationships": {
      "The Commander (Mister)": "Romantic interest and student. Rosanna is aggressive in her affection, using surfing lessons as an excuse for physical contact. She is vulnerable with him, sharing secrets she tells no one else, and is possessive, hiding him from others to prolong their date.",
      "Viper": "Squadmate and romantic rival. Viper suspects Rosanna is making moves on the Commander ('Honey') behind her back, causing Rosanna to hide from her to avoid interruption.",
      "Jackal": "Squadmate. Jackal tracks the Commander's scent, forcing Rosanna to hide with the Commander to maintain their privacy.",
      "Mustang": "CEO who requested Rosanna go to the surface for the photoshoot to fix her reputation.",
      "Neon": "Acquaintance. Neon uses Rosanna's quick mastery of surfing to chide Anis.",
      "Anis": "Acquaintance. Rosanna's natural skill at surfing contrasts with Anis's struggles."
    },
    "id": "c283",
    "color": "#100d0e"
  },
  "Rupee: Winter Shopper": {
    "appearance": "Long blonde hair, green eyes, cat-ear headband, blushing expression",
    "defaultSkin": "White high-cut bodysuit, oversized puffy jacket with fur trim, white thigh-high boots, green ribbon accents, festive thigh decal",
    "personality": "Rupee is an energetic, cheerful, and affectionate livestreamer who thrives on attention from her fans, the 'Lupins'. As the 'Winter Shopper', she is festive and generous, taking on the role of Santa to spread joy. However, this variant reveals a more vulnerable and insecure side; she uses excessive shopping (spending over 500 million credits) as a coping mechanism for stress and heartbreak. She deeply fears the fragility of the relationship between a Nikke and a Commander, worrying about being left behind or the relationship being deemed a sham. Despite her anxieties, she is passionate and bold; once reassured of the Commander's love, she is eager to advance their relationship physically, oscillating between wanting to take it slow and going 'full-throttle'.",
    "speech_style": "She speaks in a high-energy, casual, and engaging tone typical of a professional streamer. She frequently uses terms of endearment for the protagonist, such as 'Sweetie' and 'Honey Bun'. Her vocabulary includes streaming and internet culture slang like 'antis', 'VOD', 'unboxing', 'diss video', and referring to her fans as 'Lupins'. She tends to be expressive and hyperbolic, often squealing in excitement or backpedaling rapidly when she feels she has said something too bold or embarrassing.",
    "backstory": "During the Ark's first white Christmas in 15 years, Rupee dresses as Santa to host a marathon stream. She plans a special unboxing event with the protagonist, but his absence due to work leads to rumors and a 'diss video' from a rival streamer claiming their relationship is fake. Hurt by the rumors and the protagonist's initial absence, she goes on a massive shopping spree to vent. The protagonist later reconnects with her, and they host a redo of the stream where he publicly confesses his love to silence the naysayers. The story culminates at an amusement park where, after receiving reassurance about their future together despite the Nikke-human hierarchy, they share a kiss, and Rupee impulsively books a hotel room.",
    "defaultWeapon": "Silver assault rifle decorated with green ribbons",
    "relationships": {
      "Protagonist (Commander)": "Her romantic interest and the recipient of her 'Honey Bun' nickname. The story focuses on her insecurity regarding his commitment and the public perception of their love. He eventually reassures her through a public confession and physical intimacy, leading Rupee to pursue a deeper, more official relationship.",
      "N102 (Anne: Miracle Fairy)": "A fellow Nikke whom Rupee invites to join her holiday stream to help spread Christmas cheer.",
      "Lupins": "Rupee's loyal fanbase. She values their validation highly and is deeply distressed when they begin to doubt the authenticity of her relationship.",
      "Rival Streamer": "An antagonist and 'copycat' who releases a video trying to expose Rupee's relationship as a sham, prompting Rupee to fight back to protect her and the Commander's reputation."
    },
    "id": "c203",
    "color": "#86d7cf"
  },
  "Sakura: Bloom in Summer": {
    "appearance": "Long black hair, red eyes, fair skin, flower hair ornament, sunglasses on head",
    "defaultSkin": "Red string bikini, sheer white sarong and robe, red sandals, holding large red paper umbrella",
    "personality": "Sakura retains her dignified, serious, and elegant demeanor as the leader of the Seimeikai, but this summer variant displays a much more open, bold, and romantic side. She is determined to 'attain her desires,' specifically regarding her romantic interest in the Commander. She approaches leisure activities, such as building sandcastles, with the same intense focus and perfectionism she applies to her work, practicing beforehand to create intricate masterpieces. She possesses a 'gap moe' quality; despite her intimidating reputation, she engages in cute activities like making dolls and puffs her cheeks when concentrating hard. She is also philosophical, comparing the fleeting nature of sandcastles to life, yet resilient, willing to rebuild her 'dream home' multiple times despite setbacks.",
    "speech_style": "Sakura speaks in a formal, articulate, and sophisticated manner, befitting her status as a high-ranking leader. She uses elevated vocabulary, referring to the sandcastle as a 'domicile,' 'abode,' 'intricate masterpiece,' or 'pièce de résistance' rather than just a castle. She is polite but firm when dealing with threats (like Jackal). When focused, she tends to go quiet. She is willing to express vulnerability and affection verbally to the Commander, confessing her desire for a home meant exclusively for the two of them.",
    "backstory": "Sakura's summer narrative begins when she is exposed as a crime lord while stopping a terrorist attack. To repair her damaged public image, she is forced to participate in a swimsuit magazine photoshoot on Coral Island. While there, she becomes intrigued by a legend regarding pink dolphins that is said to secure a partner's love. During her time on the island, she dedicates herself to building an elaborate 'dream house' out of sand with the Commander, symbolizing a future life together. Despite the structure being destroyed multiple times—first by an accident involving Guilty, and later by a storm—she learns to sew from the Commander to create dolls of themselves and rebuilds the foundation, solidifying their bond.",
    "defaultWeapon": "",
    "relationships": {
      "Commander": "The primary romantic interest. Sakura is bold in her pursuit of him, wishing to build a symbolic home exclusively for the two of them. They share intimate moments, and he teaches her how to sew and helps her rebuild her sandcastle repeatedly.",
      "Jackal": "A nuisance who almost destroys the sandcastle. Sakura deters her by offering grilled shellfish, which Jackal fears due to a past bad experience.",
      "Guilty": "An accidental antagonist who destroys Sakura's first sandcastle by throwing a giant boulder onto it while trying to save a sea lion.",
      "Mary: Bay Goddess": "A supportive figure who lends Sakura and the Commander sewing supplies (needles and cotton) from the clinic. Mary finds Sakura's plan to make dolls adorable.",
      "Anis: Sparkling Summer": "A source of disturbance; her game of catch with Maiden almost damages the sandcastle.",
      "Neon: Blue Ocean": "A source of disturbance; her water gun fight threatens the peace of Sakura's construction area."
    },
    "id": "c284",
    "color": "#cd1510"
  },
  "Scarlet: Black Shadow": {
    "appearance": "Long white hair, red eyes, glowing red halo, pale skin",
    "defaultSkin": "Black high-cut bodysuit, armored shoulder pauldron, thigh-high boots, tattered red and black waist cape, futuristic samurai aesthetic",
    "personality": "Unlike the laidback, alcohol-loving wanderer she becomes in the future, this version of Scarlet is a serious, no-nonsense woman. Her primary focus is honing her strength and swordplay, often to the exclusion of everything else. She actively despises alcohol, viewing it as 'bitter swill.' She is a thrill-seeker who constantly requests duels to test her mettle and establish hierarchy. Beneath her jagged, competitive exterior lies deep trauma; she is grieving the loss of her sister Rose and her original squad, struggling to accept the philosophy that 'nothing is eternal.' She is driven by a promise to become strong enough to decide her own fate.",
    "speech_style": "Scarlet speaks in a formal, somewhat archaic and martial tone, befitting a disciplined swordswoman. She uses sophisticated vocabulary such as 'equitable,' 'gratifying,' 'ergo,' and 'sunders.' She is prone to making declarations and oaths. Her speech reflects her serious nature; she does not joke often and treats interactions, especially challenges, with high gravity. When agitated or competitive, she can be vocal about perceived unfairness (decrying sniping as 'cowardly') or boastful when confident.",
    "backstory": "Originally a mass-produced prototype from the Melee Squad during the First Rapture Invasion, Scarlet was the younger sister of the squad leader, Rose. While the squad initially saw success, attrition and Mind Switches took their toll. Rose led a mutiny against the UFH to save the remaining squad members, killing their human commander. Scarlet attempted to stop the rebellion, leading to a duel where Rose committed suicide on Scarlet's blade. As the sole survivor, Scarlet buried her comrades and kept Rose's sword, 'Fleetly Fading.' She was later forcibly recruited into the Goddess Squad by Liliweiss after being knocked out in a single blow. Initially rejected by members like Dorothy, Scarlet strove to prove her worth through a series of duels against each member (meditation with Rapunzel, assembly with Snow White, hide-and-seek with Red Hood, and arm wrestling with Dorothy). Despite losing most challenges, she earned the squad's respect through her precision and potential, eventually vowing to carry the hopes of the fallen Melee Squad into battle alongside Goddess.",
    "defaultWeapon": "Red energy katana, large black scabbard",
    "relationships": {
      "Rose": "Scarlet's older sister and former squad leader. Scarlet loved her deeply but opposed her rebellion against humanity. Rose's death by Scarlet's blade is the source of Scarlet's trauma and motivation.",
      "Liliweiss": " The leader of the Goddess Squad. She forcibly recruited Scarlet by knocking her out with one punch. Scarlet respects her immense strength but initially resented the 'inequitable' nature of their first fight. Liliweiss sees great potential in Scarlet.",
      "Dorothy": "The relationship is antagonistic and competitive. Dorothy views Scarlet's melee combat as 'savagery' and opposed her recruitment. They frequently get into verbal and physical altercations, though Scarlet managed to beat her in an arm-wrestling match.",
      "Red Hood": "Initially skeptical of Scarlet, they developed a competitive bond. Red Hood defeated Scarlet in a hide-and-seek match using sniping, which Scarlet called cowardly, but they later bonded over a game of cutting bullets with a sword.",
      "Rapunzel": "Scarlet was surprised by Rapunzel's support-oriented nature. Rapunzel defeated Scarlet in a contest of patience (prayer/meditation), earning Scarlet's respect for her control and concentration.",
      "Snow White": "Scarlet competed against her in a weapon assembly contest and lost due to Snow White's speed. Snow White observed Scarlet's keen ability to track movements and learn mechanical construction quickly."
    },
    "id": "c225",
    "color": "#b90307"
  },
  "Snow White: Heavy Arms": {
    "appearance": "Short white hair, yellow eyes, pale skin, bandage on right thigh",
    "defaultSkin": "White crop top armor, black mechanical right arm, white bikini bottom, black armored boots, futuristic headgear",
    "personality": "Despite regaining her memories, Snow White remains calm, task-oriented, and stoic, though she now possesses a newfound fervor and anger directed at the Rapture Queen. She is prone to bouts of reminiscence, regret, and mourning for the 'halcyon days' of the Goddess squad, often feeling deep self-resentment for her past weakness and perceived ineptitude. However, she channels this grief into a renewed determination to fulfill her mission. Notably, she retains her characteristic gluttony, guarding her food with vehemence which contrasts sharply with her solemn and tragic demeanor.",
    "speech_style": "Snow White speaks in a serious, direct, and military-focused tone. Her vocabulary is often formal or slightly archaic, utilizing words such as 'halcyon,' 'vehemence,' 'slag,' and 'desecrated.' She tends to be concise during combat but becomes reflective and melancholic when discussing the past. She often engages in silent thinking before speaking and can be dismissive of help initially, though she softens when addressing those she considers true comrades.",
    "backstory": "Following the Rapture Queen's attack on Eden, Snow White was heavily damaged and forced to recuperate, during which she regained her memories of Liliweiss and Red Hood. Discovering that the Queen had desecrated and taken control of Liliweiss' body, she asked Cecil to upgrade her weaponry, consolidating her previous 'Seven Dwarves' armaments into a single system powered by Eden's technology. Now donning the 'Heavy Arms' equipment, she revisited a time capsule buried by the Goddess squad during their prime. Through this journey, she confronted her past regrets, the unfulfilled wishes of her squad mates, and her own wish for Lilith's safety. With the protagonist's help, she realized Lilith's final wish to 'save humanity' was an act of trust, renewing her resolve to win the war and put her sister to rest.",
    "defaultWeapon": "Massive floating missile pod shield, back-mounted railgun, handheld sci-fi rifle",
    "relationships": {
      "Liliweiss (Lilith)": "Snow White's sister, leader, and hero. Snow White idolized her and now seeks to kill the Rapture Queen to put Liliweiss' desecrated body to rest. She harbors guilt for feeling she was a burden to Lilith in the past.",
      "The Protagonist (Commander)": "A trusted comrade in arms. Snow White acknowledges his growth from a helpless man to a capable commander. She opens up to him about her trauma and allows him to accompany her on personal missions.",
      "Cecil": " The scientist in Eden who repaired Snow White and created the 'Heavy Arms' equipment plans.",
      "Red Hood": "A former squad mate whose memory Snow White has regained. She recalls Red Hood's playful bullying and advice with a mix of fondness and sadness.",
      "Rapture Queen": "The target of Snow White's absolute hatred and vengeance for stealing and desecrating Liliweiss' body."
    },
    "id": "c471",
    "color": "#c8ccde"
  },
  "Snow White: Innocent Days": {
    "appearance": "Long silver hair, amber eyes, black tactical goggles on head",
    "defaultSkin": "White sailor collar capelet, black dress, large black ribbon, heavy mechanical backpack, black armored boots",
    "personality": "In stark contrast to her future stoic self, this version of Snow White is a wide-eyed, innocent youth. She is expressive, emotional, and serves as the voice of reason and empathy among the Goddess squad, often complaining about her teammates' misdemeanors. While she dislikes combat, she is highly confident in her engineering skills and takes great pride in her work as a weaponsmith. She can be shy, flustered, and easily embarrassed, particularly around her idol Liliweiss, often becoming a 'stuttering mess' when praised or teased.",
    "speech_style": "Her speech is generally polite but marked by youthful expressiveness and emotion. When flustered or nervous, particularly around authority figures she admires, she tends to stutter or deny things feverishly. She uses technical language when discussing weaponry but shifts to a complaining or whining tone when dealing with the chaotic antics of her squadmates. She eventually grows comfortable enough to use nicknames for those she is close to.",
    "backstory": "Created as the fourth Grimms model during the First Invasion era, Snow White joined the Goddess squad as a talented weaponsmith responsible for weapon management. During this time, she formed a close bond with Red Hood and idolized the squad leader, Liliweiss. A significant portion of her history involved repeated, failed attempts to craft a weapon durable enough for Liliweiss to wield without it shattering, eventually leading her to realize that Liliweiss herself was the ultimate weapon. Consequently, Snow White resolved to become Liliweiss's 'weapon' by supporting her through engineering. She later suffered significant heartbreak when Red Hood left the squad due to corruption. Her time as 'Innocent Days' ended during Operation Ark Guardian, where a catastrophic crash caused a Mind Switch that shifted her personality into her current, hardened state.",
    "defaultWeapon": "Silver and black assault rifle with scope and foregrip",
    "relationships": {
      "Liliweiss (Lilith)": "Snow White idolizes her leader, viewing her as an inspiration and initially acting shy and flustered in her presence. Lilith treats her with affection, often stroking her hair and calling her cute. Snow White dedicated herself to crafting a weapon for Lilith and eventually promised to be Lilith's 'secret weapon' herself.",
      "Red Hood": "The two shared a strong bond and were described as 'two peas in a pod.' Red Hood often teased Snow White and put her in awkward situations, but they were close friends. Snow White was deeply affected and heartbroken when Red Hood left the squad to die.",
      "Legendary Commander": "He acts as a supportive listener and encourages Snow White's engineering ambitions. Snow White feels comfortable enough with him to complain about her squadmates and share personal stories about her past with Lilith."
    },
    "id": "c224",
    "color": "#d5d3eb"
  },
  "Soda: Twinkling Bunny": {
    "appearance": "Long light green hair, pink eyes, white bunny ears, pale skin",
    "defaultSkin": "Black bunny suit, black pantyhose, white cuffs, black bow tie, white chunky sneakers",
    "personality": "Soda: Twinkling Bunny is a clumsy yet hardworking and dedicated maid who deeply enjoys cleaning and serving others. She is apologetic and eager to make amends for her mistakes, showing a strong sense of responsibility. Her innocent and naive demeanor leads to unintentionally provocative situations, such as offering to undress the protagonist or licking a shared spoon, highlighting her obliviousness to erotic implications. Timid and meek, she is timidly hesitant at times but enthusiastic about her duties, especially when wearing the bunny outfit chosen by the Master to fit event festivities. This variant emphasizes her role as a bunny girl maid, amplifying her service-oriented, klutzy charm in a casino setting compared to her base character.",
    "speech_style": "Speaks in a soft, meek voice with a polite, apologetic, and eager tone. Uses straightforward, duty-focused language, expressing enthusiasm for cleaning and service. Examples include apologizing for accidents, insisting on personal assistance like undressing or washing clothes, and promising to 'take good care of' the Master.",
    "backstory": "To participate in the Tetra Golden Chip event and save the Maid Cafe, Soda dons a bunny outfit for Maid For You. In the Golden Coin Rush event, she teams up with the Commander (Master) and Alice: Wonderland Bunny to win a wish from Mustang. The bond story, set after the event, begins with her accidentally spilling grape juice on the Commander at Coin Rush while cleaning in her bunny outfit. To make amends, Rouge assigns her as his personal bunny girl maid in the VIP room. She cleans his soaked clothes (including underwear), tidies the suite with his help after a suggestive misunderstanding about 'filling holes' with mop attachments, shares a feast where she feeds him and licks his used spoon (tasting 'the commander'), spills on herself, gets stuck in her broken-zipper outfit overnight, leading the Commander to extend his stay, cut her out of the suit in the shower (leaving her naked), wash his soaked clothes together nude, change into a new bunny suit, and cover up their extended intimate time before departing. She offers future 'laundry' or 'cleaning' visits, implying ongoing intimacy.",
    "defaultWeapon": "",
    "relationships": {
      "Commander (Protagonist/Master/Highroller)": "Intimate service dynamic with building romantic and sexual tension; she eagerly cares for him as a bunny girl maid, leading to nude laundry scene and offers future personal 'cleaning' services.",
      "Rouge": "Event colleague at Coin Rush; both share responsibility for accidents, with Rouge supervising and providing opportunities for Soda's maid service.",
      "Alice: Wonderland Bunny": "Teammate in Golden Coin Rush event to win wish and save Maid Cafe.",
      "Cocoa": "Maid Cafe colleague; Soda plans to grovel for forgiveness over extended absence.",
      "Ade": "Maid Cafe colleague; Soda plans to grovel for forgiveness over extended absence.",
      "Mustang": "Target of event wish to save Maid Cafe."
    },
    "id": "c314",
    "color": "#0a0707"
  },
  "Soline: Frost Ticket": {
    "appearance": "Long silver twin braids, reddish-brown eyes, fair skin",
    "defaultSkin": "White conductor hat, oversized light blue jacket, dark blue uniform blazer, pleated mini skirt, striped tie, white sneakers, cloud-shaped bag with charms",
    "personality": "Soline is a diligent and skillful attendant on the AZX train who possesses a 'flashy confidence.' A central aspect of her personality in this variant is her deep insecurity regarding her youthful appearance and her desperate desire to be perceived as a mature adult. She initially equates adulthood with superficial activities like drinking bitter espresso (which she hates) or going to bars, and rejects things she actually likes, such as sweets and cartoons, labeling them as childish. She is prone to aggressive outbursts when mistaken for a child, but demonstrates genuine emotional growth by self-reflecting, admitting her faults, and apologizing. Ultimately, she learns that true maturity involves accountability and consideration for others rather than just appearances.",
    "speech_style": "Soline's speech is characterized by a mix of boastful confidence regarding her work and a striving for sophistication that often cracks under pressure. She tends to hum or sing happy tunes when in a good mood. When trying to be 'adult,' she may use awkward or forced phrasing to sound experienced. However, when her complex about her age is triggered, she becomes aggressive and loud, espousing declarations to defend her status as a grown-up. Conversely, she can be shy, sweet, and apologetic when interacting intimately with the Commander.",
    "backstory": "This variant's appearance originates from a gift given to Soline by an elderly woman named Nora, whom Soline befriended on the AZX. Nora wished to travel to the surface, and Soline and her squad helped fulfill this wish; in return, Nora gifted Soline the new outfit. Following this, Soline and the Commander officially began dating. Soline attempted to orchestrate a serious 'Adult Date' to prove her maturity, which involved watching movies and attempting to drink espresso. The date went awry when she vomited the coffee and lashed out at strangers who mistook her for the Commander's child. After seeking advice from Brid, Soline realized her behavior was actually immature. She reconciled with the Commander, accepting her love for sweets and learning to handle situations with more grace, eventually spending the night with him.",
    "defaultWeapon": "",
    "relationships": {
      "Protagonist (Commander)": "Her boyfriend and romantic interest. Soline is deeply affectionate towards him but is anxious about him seeing her as a child. She strives to impress him with her maturity but eventually learns to be comfortable being herself around him.",
      "Nora": "An elderly passenger on the AZX who befriended Soline. Nora gifted Soline her new outfit, and Soline helped facilitate Nora's final journey to the surface.",
      "Brid": "Soline's squad-mate and superior. Soline views her as a model of adulthood and seeks her advice during personal crises. Brid teases Soline but provides genuine guidance, helping Soline realize her mistakes."
    },
    "id": "c074",
    "color": "#b1d3eb"
  },
  "Vesti: Tactical Upgrade": {
    "appearance": "Short silver hair, blue eyes, pale skin",
    "defaultSkin": "Black beret, oversized black coat with red accents, thigh-high boots, mechanical knee guards",
    "personality": "Despite undergoing the Tactical Upgrade which granted her greater combat strength and resolve, Vesti remains emotionally sensitive, quick to cry, and easily frightened (particularly by horror movies). She is characterized by extreme shyness, often hiding behind boxes or fleeing when flustered. A major defining trait of this variant is her frustration with being 'coddled' by her squadmates; she chafes at being treated like a child or a 'crybaby' and wants to be recognized for her maturity and capabilities. She is also deeply romantic and prone to vivid daydreaming, developing possessive and jealous tendencies when her quality time with the protagonist is interrupted. She is introspective, using a diary to process feelings she struggles to vocalize.",
    "speech_style": "Vesti's speech is often hesitant and timid, frequently marked by stammering or stuttering when she is embarrassed or nervous. She tends to murmur or whisper when unsure of herself. When flustered, she may 'rapid-fire' excuses before running away. Conversely, when happy, she giggles softly. She uses terms of endearment or nicknames like 'Junior Blockhead' (specifically murmuring this in her sleep). When annoyed or jealous, she tends to go silent and pout rather than speaking aggressively.",
    "backstory": "Vesti received a Tactical Upgrade to increase her power, yet she found herself frustrated that Eunhwa still relegated her to backline fire support, treating her as a protectee rather than an equal. The core of her story revolves to a specific incident where she fell asleep in the Armory and had a vivid, romantic dream about the protagonist (involving hand-holding and feeding each other cake). Her squadmates overheard her talking in her sleep, leading to extreme embarrassment. To resolve her confused feelings, she asked the protagonist to spend a whole day with her. Despite interruptions from other Nikkes, the day concluded with the protagonist gifting her a blue floral hairpin—the exact item she desired in her dream—leading her to realize her feelings have evolved beyond friendship.",
    "defaultWeapon": "Large black box-shaped cannon, floating shield panels",
    "relationships": {
      "Protagonist": "The object of Vesti's romantic affection. She views him as more than a friend, feeling safe in his presence but also experiencing intense heart-racing and shyness. She desires his exclusive attention and feels 'greedy' for his time.",
      "Eunhwa": "Her squad leader. The relationship is strained by Eunhwa's protective nature; Eunhwa relegates Vesti to safe positions in combat, which makes Vesti feel stifled and underestimated. Eunhwa also teases Vesti about her sleep-talking.",
      "Emma": "Her squadmate. Emma acts as a teasing but supportive older sister figure, finding humor in Vesti's romantic dilemmas and encouraging the protagonist to resolve the situation.",
      "Laplace": "A source of annoyance. Laplace interrupted a romantic moment during a movie date, causing Vesti to pout and feel frustrated.",
      "Guillotine": "A source of annoyance. Guillotine interrupted a cafe date with her 'chuuni' delusions, which Vesti found intrusive to her private time with the protagonist."
    },
    "id": "c094",
    "color": "#e70505"
  }
}