[
  {
    "date": "October 1st 2023",
    "update": "Release of the Vue3 code!"
  },
  {
    "date": "October 3rd 2023",
    "update": "Added a fullscreen option on the chibi page. Added Marciana, Naga, Tia, Novel Halloween to the chibi page. Fixed Pepper skin, Yuni and Mihara live2d issues. Minor UI/UX improvement"
  },
  {
    "date": "October 5th 2023",
    "update": "Added Diesel Strawberry Flower live2d"
  },
  {
    "date": "October 7th 2023",
    "update": "Fixed Dorothy aim and cover bondaries when selecting a skin. Fixed a display issues for 2k and above resolution screens"
  },
  {
    "date": "October 7th 2023",
    "update": "Added Dazzling Cupid eventscenes"
  },
  {
    "date": "October 8th 2023",
    "update": "Added the gallery page, with White Memory, Album Covers and Chapter Thumbnails" 
  },
  {
    "date": "October 19th 2023",
    "update": "Added Quiry, Privaty Banquet Princess to live 2d" 
  },
  {
    "date": "October 19th 2023",
    "update": "Chibi v0.12: Added Diesel second skin, Quiry, Privaty Banquet Princess. Small bug fixes" 
  },
  {
    "date": "October 20th 2023",
    "update": "Added Nikke Twitter 4 panel comics in english, japanese and korean in the gallery" 
  },
  {
    "date": "October 24th 2023",
    "update": "Added ACPU FREEZE, and a lot of bosses live2d, find them by searching the key name \"Boss:\" in the character selector" 
  },
  {
    "date": "October 29th 2023",
    "update": "Added the custom spine loader feature" 
  },
  {
    "date": "October 29th 2023",
    "update": "Added the hide UI feature" 
  },
  {
    "date": "October 31st 2023",
    "update": "Added 4koma 31 for all three languages" 
  },
  {
    "date": "October 31st 2023",
    "update": "Added background image pack" 
  },
  {
    "date": "November 5th 2023",
    "update": "Gallery: Added chapter 25, 26 thumbnails, added the new album images, added 4koma 32 for all three languages" 
  },
  {
    "date": "November 5th 2023",
    "update": "Live2d: Added two RED ASH EventScenes, Red Hood, Snow White: Innocent Days, Commander (GODDESS), Liliweiss, Dorothy Nostalgia, Story chapter 25 and 26 event scenes" 
  },
  {
    "date": "November 5th 2023",
    "update": "Gallery: Added story pictures for all 26 chapters, added events " 
  },
  {
    "date": "November 5th 2023",
    "update": "Chibi: version 0.13, add RED ASH chibis " 
  },
  {
    "date": "November 10th 2023",
    "update": "Updated Dorothy Nostalgia (if you know, you know). Added Anachiro | Cinderella, Freesia, Oswald. Added RED ASH event gallery" 
  },
  {
    "date": "November 12th 2023",
    "update": "Added missing White Memory live2d. Added missing RED ASH, OUTER AUTOMATA, Nya Nya paradise, Sea You Again, 777 gallery images (1 each)" 
  },
  {
    "date": "November 16th 2023",
    "update": "Added Mass Produced Red l2d. Added 4koma 33 for all 3 languages" 
  },
  {
    "date": "November 23rd 2023",
    "update": "Added Tove, Noir Black Rabbit, 4koma 34 and 35 in all three languages" 
  },
  {
    "date": "November 25th 2023",
    "update": "Updated the chibi viewer to 0.14. Add l2d for Alone Survivor and Miracle Snow" 
  },
  {
    "date": "December 9th 2023",
    "update": "Added christmas Ludmilla and Mica, added Blanc White Rabbit, added Neverland eventscene, add Neverland album cover, added 4koma 36, 37 for all three languages."
  },
  {
    "date": "December 25th 2023",
    "update": "Added Ghost Lua/Lena/Lumi l2d"
  },
  {
    "date": "December 25th 2023",
    "update": "Added Neverland image gallery. added 4koma 38 and 39 for all three languages"
  },
  {
    "date": "December 27th 2023",
    "update": "Added Lumi l2d and Snow Fall Oasis event gallery"
  },
  {
    "date": "December 29th 2023",
    "update": "Added Scarlet: Black Shadow, Rose, Mass Manufactured Melee, Liter Cute Sunflower, Noise Classic Diva, Guillotine Dark Tracer, New Year New Sword live2d"
  },
  {
    "date": "January 1st 2024",
    "update": "Chibi version 0.14 -> 0.16 : added Neverland and New Year New Sword characters"
  },
  {
    "date": "January 6th 2024",
    "update": "Pushed a potential fix for /visualiser on monitors of a resolution of upscaled-4K or more. Added 4koma 40 for all three languages. Added Mass Produced Melee 2's l2d"
  },
  {
    "date": "January 11th 2024",
    "update": "Added Leona, Moran, Sugar Wild Backyard l2d. Added 4koma 41"
  },
  {
    "date": "January 14th 2024",
    "update": "Added Lion Heart event l2d"
  },
  {
    "date": "January 15th 2024",
    "update": "Chibi v0.17: Added Leona, Sugar and Moran chibi"
  },
  {
    "date": "January 28th 2024",
    "update": "Added D Outsider and Dirty Backyard live2d. Added 4koma 42 for all three languages"
  },
  {
    "date": "February 7th 2024",
    "update": "Added Privaty: Unkind Maid, Drake Maid For Villain. Updated Ade's assets. Added Perfect Maid EventScene. Added Smol Maid Privaty and Smol Ade from the Perfect Maid Minigame. Added 4koma 43 for all three languages."
  },
  {
    "date": "February 7th 2024",
    "update": "Chibi v0.18: Added Privaty: Unkind Maid, Drake Maid For Villain, Ade"
  },
  {
    "date": "February 9th 2024",
    "update": "Custom Spine Viewer : implemented a potential fix for atlas files using non modern-latin alphabet ( eg objects with korean/japanese/chinese letters in their name ). Example: c170_02.atlas "
  },
  {
    "date": "February 11th 2024",
    "update": "Custom Spine Viewer : implemented a way to load 2-png assets (c470 for instance). Implemented a Pre Multiplied Alpha option for broader uses than only nikke assets."
  },
  {
    "date": "February 24th 2024",
    "update": "Added Elegg, Trony, BOOM's DAY live2d. Added BOOM's DAY gallery image. Added 4koma 44, 45 and 46."
  },
  {
    "date": "March 1st 2024",
    "update": "Chibi : v0.18 -> v0.20. Added Elegg. Added a custom background color picker. Added a shortcut to hide the UI (H)"
  },
  {
    "date": "March 1st 2024",
    "update": "Live2d : Added Exia Gamer, Liveryn, Hammering, Flora, Unknown, Raptillion, T.Rony."
  },
  {
    "date": "March 1st 2024",
    "update": "Gallery : Added chapter 27 & 28 image galleries in the \"Chapters 26 to 30\" tab. Added the Unknown album cover. Added ch27 and ch28 thumbnails. Added 4koma 47"
  },
  {
    "date": "March 8th 2024",
    "update": "Live2d : Added D: Killer Wife, Rosanna Kill The Lord, Kill The Lord."
  },
  {
    "date": "March 8th 2024",
    "update": "Gallery : Added Kill The Lord"
  },
  {
    "date": "March 12th 2024",
    "update": "Tools: Fixed the images for credit, battle data and core dust not displaying for the Synchro Calculator"
  },
  {
    "date": "March 12th 2024",
    "update": "Chibi: Added Exia Gamer and D: Killer Wife"
  },
  {
    "date": "March 17th 2024",
    "update": "Pushed v0.1 of the Tier List Maker"
  },
  {
    "date": "March 19th 2024",
    "update": "Gallery: Added 4koma 48"
  },
  {
    "date": "March 19th 2024",
    "update": "Live2D : export as WebM feature for PC users. Made by Kalila (digisomni) on GitHub!"
  },
  {
    "date": "March 20th 2024",
    "update": "Live2D : Added All Rem Ram Emilia assets"
  },
  {
    "date": "March 20th 2024",
    "update": "Gallery: Added recipe album cover"
  },
  {
    "date": "April 6th 2024",
    "update": "Live2d: Fixed Shift Up anatomy mistakes on Flopmilia and Ramid"
  },
  {
    "date": "April 6th 2024",
    "update": "Live2d: Added good content such as Poli Cheer Up Police, Syuen (debatable), and renamed Rosanna's skin to it's correct name"
  },
  {
    "date": "April 6th 2024",
    "update": "Gallery: Added the boring recipe photos"
  },
  {
    "date": "April 6th 2024",
    "update": "Gallery: Added Liar's End masterpiece"
  },
  {
    "date": "April 13th 2024",
    "update": "cheeleader patch"
  },
  {
    "date": "April 28th 2024",
    "update": "Gallery: Added 4koma 49. Added chapter 29 & 30 thumbnails. Added Last Kingdom album cover. Added chapter 29 & 30 story images"
  },
  {
    "date": "April 28th 2024",
    "update": "Live2D: Updated Unknown name to Grave. Updated Crown assets. Updated Modernia Second Affection assets and her name. Updated Hammering assets. Added One More Time Eventscene. Added Diesel Midnight Strawberry. Added Snow White White Knight. Added T.A.L.O.S and Kilo. Added Fragile. Added Drilley. Added Brand New Year EventScene."
  },
  {
    "date": "May 1st 2024",
    "update": "Live2D: WebM export now sets a background color instead of transparent/black. This helps fixing transparent pixels related issues."
  },
  {
    "date": "May 4th 2024",
    "update": "Live2D: Added a High and Low Quality setting. Defaults to High Quality"
  },
  {
    "date": "May 19th 2024",
    "update": "Tools: Updated the outpost tool to handle levels 301 to 400."
  },
  {
    "date": "May 19th 2024",
    "update": "Gallery: Added 4koma 50. Added Last Kingdom. Added Dark Hero."
  },
  {
    "date": "May 19th 2024",
    "update": "Live2D: Updated Diesel Midnight Strawberry aim assets. Added Black Ark Ranger. Updated Chime assets. Added Crown Naked King. Updated Trony assets. Added Last Kingdom event scene. Added D.ARK HERO event scene. Added High Tech Toy event scene. "
  },
  {
    "date": "May 19th 2024",
    "update": "Live2D: Fixed a bug that caused the button Z to also trigger the change of the asset quality feature. Reduced the default transformation scale to fit better within the screen."
  },
  {
    "date": "May 19th 2024",
    "update": "Custom Live2D : Added a Straight to Premultiplied Alpha converter, and the other way around"
  },
  {
    "date": "June 2nd 2024",
    "update": "Gallery : Added Golden Coin Rush album cover. Added 4koma 51. Added Golden Coin Rush event."
  },
  {
    "date": "June 2nd 2024",
    "update": "Live2D : Added Folkwang Moist Bunny. Added Mary Medical Rabbit. Added Soda: Twinkling Bunny. Added Alice: Wonderland Bunny."
  },
  {
    "date": "June 2nd 2024",
    "update": "Live2D : Added Favorite Scenes for Diesel, Laplace, Frima, Exia."
  },
  {
    "date": "June 2nd 2024",
    "update": "Credits : Added credits for SELEKCJONER."
  },
  {
    "date": "July 6th 2024",
    "update": "Gallery : Added Beauty Full Shot's album. Added 4kome 52 & 53. Added Beauty Full Shot gallery."
  },
  {
    "date": "August 3rd 2024",
    "update": "Gallery : Chapter 31, Chapter 32, Juvenile Days, album, chapter thumbnail"
  },
  {
    "date": "August 3rd 2024",
    "update": "Live2D : Ein, Behemoth, Naga, Tia, Juvenile Days"
  },
  {
    "date": "August 8th 2024",
    "update": "colorless patch"
  },
  {
    "date": "August 21st 2024",
    "update": "evangelion patch"
  },
  {
    "date": "September 21st 2024",
    "update": "jinx player patch"
  },
  {
    "date": "October 27th 2024",
    "update": "added missing l2d from the persona 5 refused collab, added mihara, rumani, need for speed, N Corp Groẞhammer Yuni. Side story 02 gallery, life again scene and uhhh that's it"
  },
  {
    "date": "November 1st 2024",
    "update": "added cindy + skin , lil' mermaid, red boots, kimono bazooka boobas, loliviathan, grave, abe, dwife skin, bride yandere, rapi hood, the new horny trio, hansel, gretel. Holy crap why does anachiro have so many animations a god damn scrollbar appears."
  },
  {
    "date": "November 24th 2024",
    "update": "Updated flora. Added volume :cold_face:. Added old tales album, live2d scene, gallery. Added secret garden scene. Added chapter 33 + 34 gallery"
  },
  {
    "date": "December 14th 2024",
    "update": "added maiden, guillotine, vesti, ice dragon saga l2d & gallery & album, dragon dungeon run gallery,  "
  },
  {
    "date": "Decembre 21st 2024",
    "update": "added a yapping mode. Also added a hit counter to gather analytics for myself. See if it's worth maintaining this hell hole. cloudflare only shows the world wide traffic of the website but no actual visitor counter."
  },
  {
    "date": "Decembre 27th 2024",
    "update": "Added Rapi, Rapi, Rapi, Rapi Hood, Ein, Zwei, Naga."
  },
  {
    "date": "January 2nd 2025",
    "update": "Added D.E.E.P, Footstep Walk Run Live2D & gallery. "
  },
  {
    "date": "January 2nd 2025",
    "update": "Re-coded the custom live2d loader to allow an infinite amount of PNG files : tested with a Brown Dust 2 asset containing 1 skel, 1 atlas, 10 png (char067401)."
  },
  {
    "date": "January 2nd 2025",
    "update": "Added the Layer Editor tool."
  },
  {
    "date": "January 5th 2025",
    "update": "Fixed layer editor duplicating layers in the search box, crashing the browser after a while. Affected characters such as 2B YoRHa Uniform 1, Snow White, Naga Last Girlhood, ..."
  },
  {
    "date": "January 5th 2025",
    "update": "Expanded the color slider from 0..255 to 0..510 to allow over-saturation of colors. Meaning it's possible to white wash clothes or characters. It still has it's limits."
  },
  {
    "date": "January 5th 2025",
    "update": "Refactored some code to avoid insanely recursive methods on the layer editor lol."
  },
  {
    "date": "January 5th 2025",
    "update": "Added an export and import feature to the layer editor. Does NOT work for custom imported animations. Can break when a character gets updated with new animations."
  },
  {
    "date": "January 16th 2025",
    "update": "Updated Mana, Added Jien, Added Wisdom Spring event scene."
  },
  {
    "date": "January 16th 2025",
    "update": "Fixed Layer Editor not handling custom spines. Fixed custom loader png duplication."
  },
  {
    "date": "January 24th 2025",
    "update": "Added Mast, Anchor, Trony skin, Sin skin"
  },
  {
    "date": "February 21st 2025",
    "update": "Added the EVA characters + skins"
  },
  {
    "date": "February 21st 2025",
    "update": "Added Helm and Biscuit Skins."
  },
  {
    "date": "February 21st 2025",
    "update": "Added Smol Mast Pirate + Anchor + Sin, Pirate Cafe, Romantic Valentine, Sweet Johnny"
  },
  {
    "date": "February 21st 2025",
    "update": "Updated the Favorite assets and added all of them with merged animation ! Huge thanks to Bingle."
  },
  {
    "date": "March 8th 2025",
    "update": "Gallery : added albums for evangelion 2 & chapter 36. Added chapter thumbnails for chapter 33-36. Added Second Quest. Added story chapter 35-36"
  },
  {
    "date": "March 8th 2025",
    "update": "Live2d : Renamed Grave. Added Avista & Eyeri. Added both EVA2 animations"
  },
  {
    "date": "March 15th 2025",
    "update": "Added Trina & For Rest"
  },
  {
    "date": "March 16th 2025",
    "update": "Added Simplified Chinese 4koma by pzwboy (GitHub)"
  },
  {
    "date": "March 28th 2025",
    "update": "Development QoL, removed a middle-man verification layer to import more safely assets + completed automated renaming script"
  },
  {
    "date": "March 28th 2025",
    "update": "Live2d: Added Bready, Crust, Ade & Tia Skins. Added New Flavor scene. Updated Helm post shower for the starfish emote"
  },
  {
    "date": "March 28th 2025",
    "update": "Gallery: Added For Rest & New Flavor galleries."
  },
  {
    "date": "April 5th 2025",
    "update": "Live2d: Added the chinese exclusive privaty skin and mustang asset. Added Mecha Shifty"
  },
  {
    "date": "April 5th 2025",
    "update": "Gallery: Added fool burst day gallery"
  },
  {
    "date": "April 12th 2025",
    "update": "Live2d: Updated Crust, Added Leviathan, Added true flavor"
  },
  {
    "date": "April 12th 2025",
    "update": "Gallery: Added side story 3."
  },
  {
    "date": "April 21st 2025",
    "update": "Live2d: Added the Mustang Chinese story scene from chapter 4( story 04-02 )"
  },
  {
    "date": "May 2nd 2025",
    "update": "Live2d: Added OverSpec Laplace, Drake, Maxwell. Updated OverSpec Mihara and added her skin. Added Cinderella's skin. Updated Little Mermaid and added her skin. Added GraGre's skin. Added Jin Mori. Added Mint & Prika baddies. Added Ziz"
  },
  {
    "date": "May 2nd 2025",
    "update": "Gallery: Added Unbreakable Sphere album. Added Unbreakable Sphere gallery. Added chapter 37-38 gallery. Added chapter 37-38 thumbnails."
  },
  {
    "date": "May 2nd 2025",
    "update": "Removed TierListMaker page because of lack on interest from developper side to update it. If anyone wants it back message me I'll make hidden access links."
  },
  {
    "date": "May 18th 2025",
    "update": "Live2d: Added Arcana and Arcane Archive scene."
  },
  {
    "date": "June 1st 2025",
    "update": "Live2d: K blanc noir moran lord for justice"
  },
  {
    "date": "June 2nd 2025",
    "update": "Live2d: Added liter chinese skin, also added a new toggle for custom spine loader to allow JSON skeleton data"
  },
  {
    "date": "June 14th 2025",
    "update": "Live2d: Updated the name of Privaty (CN) to Privaty Destined in Blue. Added Centi & Scarlet skins. Added Eve, Raven, Lily, Adam, Com and the respective skins."
  },
  {
    "date": "June 28th 2025",
    "update": "Live2d: Added Hermin. Added both memories teller event scenes."
  },
  {
    "date": "June 28th 2025",
    "update": "Gallery: Added Memories Teller gallery."
  },
  {
    "date": "June 28th 2025",
    "update": "Gallery: Added new chinese 4koma thanks to pzwboy (GitHub)."
  },
  {
    "date": "June 29th 2025",
    "update": "Live2d: Added Dorothy and Modernia skins exclusive to Chinese server"
  },
  {
    "date": "July 5th 2025",
    "update": "Live2d: Apparently on June 14th I did not rename privaty's cn skin, so I 've done it this time for sure. Added Sora, Sky, Cielo, 2b'skin a2'skin. Added Over the Horizon scene"
  },
  {
    "date": "July 5th 2025",
    "update": "Gallery: Added Over the Horizon gallery"
  },
  {
    "date": "July 17th 2025",
    "update": "Live2d: Added Tove and rapipi skins, added summer elegg and dorothy. Added the 8 ghosts from summer event"
  },
  {
    "date": "July 25th 2025",
    "update": "Live2d: Added the 4 new favorites with merged animation. Fixed by Bingle. Shift up is still letting the intern work on those."
  },
  {
    "date": "July 25th 2025",
    "update": "Live2d: Fixed an issue in the layer editor where occasionnaly some layers would not appear in the list and couldn't be edited. This was most recently discovered with Elegg Boom and Shock because 90% of her bra was one of those layers. Fixed for live edition, export and import features."
  },
  {
    "date": "July 25th 2025",
    "update": "Live2d: Finally decided to update the Background Image Pack on mega, check it out ! There's about 150 new images and the old ones have a higher quality than before."
  },
  {
    "date": "July 31st 2025",
    "update": "Gallery: Fixed chapter thumbnails 37 and 38. Added Albums for Memories Teller and Boom the Ghost. Added Boom the Ghost gallery. Added BFG Clean Up gallery with the help of skuqre & teazzen."
  },
  {
    "date": "July 31st 2025",
    "update": "Live2d: Added Boom the Ghost event scene."
  },
  {
    "date": "August 3rd 2025",
    "update": "Live2d: Added a preview mode to the layer editor. The layer will blink to show which is going to be modified without testing using the sliders. The Eye icon need to be hovered."
  },
  {
    "date": "August 10th 2025",
    "update": "Live2d: Updated the Eunhwa, Vesti, Emma tactical upgrades. Added Eunhwa TU skin, Julia summer skin, Exia bunny skin. Added Endless & Eternity. Added Raptures from the Absolute event. Added Nayuta"
  },
  {
    "date": "August 10th 2025",
    "update": "Gallery: Fixed Boom the Ghost 7."
  },
  {
    "date": "August 16th 2025",
    "update": "Live2d: Added Pinoccio , Mrs. Miss. Updated Liberalio. Added Faceless NPC 10 through 13. Added Absolute event scene"
  },
  {
    "date": "August 16th 2025",
    "update": "Gallery: Added absolute album cover. Added chapter 39 & 40 thumbnails. Added chapters 39 & 40 gallery"
  },
  {
    "date": "September 4th 2025",
    "update": "Live2d: Added the bunnies like uhh ade bay milk and rouge. buy silksong copies instead of that gacha skin and give your mom flowers with the rest of the cash"
  },
  {
    "date": "September 14th 2025",
    "update": "Live2d: Added Velvet"
  },
  {
    "date": "September 22nd 2025",
    "update": "Fluff: Automated the process of building gallery json. Also will be using my own compressor that I've coded while developping Limbus DB ages ago. Kind of a paused project from too much work and lack of user interest, but there's some useful tools in it. Who knows maybe I'll use the multi lingual system I've made for it for nikke one day."
  },
  {
    "date": "September 22nd 2025",
    "update": "Gallery: Added the ABSOLUTE gallery, Coins In Rush album, Coins In Rush gallery, Made In Rush gallery"
  },
  {
    "date": "September 22nd 2025",
    "update": "Live2d: Added the ABSOLUTE and Coins In Rush event scenes"
  },
  {
    "date": "September 28th 2025",
    "update": "Fluff: Wrote regex helpers for datamining QoL"
  },
  {
    "date": "September 28th 2025",
    "update": "Live2d: Added all Ada, Jill and Claire assets. Added K and D killer wife skins. Added Deipara"
  },
  {
    "date": "October 18th 2025",
    "update": "Live2d: Added RRH's skin. Added Delta: Ninja Thief. Added Reborn Evil and Go! Ninja Thief Event scenes"
  },
  {
    "date": "October 18th 2025",
    "update": "Gallery: Added the Reborn Evil gallery & album. Renamed Side story galleries with their in game titles. Added Eden Spear side story. Added Go! Ninja Thief gallery. Fixed a bug on the carousel arrows not working correctly when switching galleries"
  },
  {
    "date": "November 2nd 2025",
    "update": "Live2D: added Anis, Nayuta & her skin, Crown, Siren and Red Hood new skins, 000000/Logey, Bahamut, Mirror, Nihilister. Updated Liberalio"
  },
  {
    "date": "November 3rd 2025",
    "update": "Live2D: updated Chime"
  },
  {
    "date": "November 22nd 2025",
    "update": "Live2D: Added winter soline, jackal's skin and only one. Added one tba npc"
  },
  {
    "date": "November 22nd 2025",
    "update": "Galley: Updated chapter and albums. added chapter 41 & 42, goddess fall and blank ticket galleries"
  },
  {
    "date": "December 6th 2025",
    "update": "Live2d: Added christmas diesel, blanc, brid and bready"
  },
  {
    "date": "December 6th 2025",
    "update": "Added the Story/Roleplaying Generator feature. Developped entirely by Rhystic1 on GitHub."
  },
  {
    "date": "December 30th 2025",
    "update": "Live2D: Added emma/quency/alice skins, added the new snow white, added the AZX Service Time animations, added the Terminus Ticket animation"
  },
  {
    "date": "December 30th 2025",
    "update": "Gallery: Added Terminus Ticket Album, added Terminus Ticket event gallery, added the AZX Service Time images"
  },
  {
    "date": "December 30th 2025",
    "update": "Fixed the new SW full body not displaying"
  },
  {
    "date": "January 3rd 2026",
    "update": "Fixed the \"Fix broken animation\" button in the layer editor, which was previously permanently hiding the control buttons once clicked."
  },
  {
    "date": "January 17th 2026",
    "update": "Live2d: Added Label and 3 NPCs idk their names from ark guardian. Added Ark Guardian and Sin Editor scenes"
  },
  {
    "date": "January 17th 2026",
    "update": "Gallery: Added Ark Guardian Album Cover, Ark Guardian and Sin Editor galleries"
  },
  {
    "date": "January 17th 2026",
    "update": "Live2d: Added chinese exclusive nikkes Hua Pi (画皮) and Ying Ning (婴宁)"
  },
  {
    "date": "February 1st 2026",
    "update": "Live2d: Added Velvet, her skin and Fatal Maid scene"
  }
]